[{"subreddit":"cats","posts":[{"title":"So, I found a stray cat...","url":"http://imgur.com/gallery/CodPA","permalink":"/r/cats/comments/3a1uin/so_i_found_a_stray_cat/","score":339,"numComments":28,"subreddit":"cats","comments":[{"text":"You truly made my day with this story &amp; photos!!! Cats are often wise about people character and obviously this girl knew ya'll were \"the\" people for her to trust! Thank you so much for taking her and her babies in and taking care of them!! Please give them all some pets from me!!","score":6},{"text":"I say keep the Mom. She picked you after all. And she's obviously a smart cat. She took a chance on the two of you because she needed help, and you helped her. Intuitively she apparently knew she could trust you and your wife.\n\nYou and your wife deserve more than an upvote for helping her and her kittens out the way you are.","score":8},{"text":"I feel like stray cats find you... ","score":2},{"text":"Very slightly worried that your vet didn't notice she was lactating.  It's very obvious on a nursing mom.\n\nOther than that - congrats on the new kitties!  We've had this happen to us (fed a stray and surprise!  kittens!) and we still have the mom cat.  She's wonderful, sweet and loyal.  :)","score":8},{"text":"You are good people, OP!","score":3},{"text":"Awww looks like a Russian Blue breed! My parents have had one for a year now since she was a kitten. ","score":2},{"text":"This would hands down be the best day of my life. ","score":3},{"text":"You're so lucky :)","score":3},{"text":"Had you ever seen her around in your yard or by your shed before?  Cats will normally seek out in advance a safe place to have their babies.  They will be much safer and healthier with you inside.  It is very nice of you to help them.  The momma does look skinny.","score":6},{"text":"And that is exactly how I ended up with 2 more cats (mom and one of the kittens) except she had somehow gotten into our shared unfinished basement to have the kittens.","score":1},{"text":"She seems like a wise cat","score":2},{"text":"You're good people, OP! You've made a lifetime friend :)\nNow, be sure to get her fixed as soon as you can..don't want her getting knocked up again!","score":4},{"text":"If my experiences are true, the grey cat will be the sweetest of them all. I personally think that black cats are the most beautiful, but all the grey ones I've met were especially friendly and cute.","score":7},{"text":"=)","score":0},{"text":"The same thing just happened to me recently! I adopted a kitty that my buddy found abandoned in one of his tenants' apartments, so I decided to take her in. At her first vet visit, the vet tells me she'll be having kittens in less than a week. Sure enough, 3 kittens popped out and I was Catdad for 10 weeks. \n\nIt was a great experience, but they had to live in my room because of my roommate's dominant male kitty upstairs; so lack of sleep was standard over the 10 weeks. Wouldn't change it for the world though, they're all in their new homes and momma cat is happy as hell.","score":-2},{"text":"So fucking awesome, thank you!","score":2},{"text":"Good for you!  One thing you can do (even after she is rehydrated to keep her that way) is to mix a couple tablespoons of water into her wet food. Cats dont always drink enough water even when they have it.","score":3},{"text":"You didn't find her, she found you. Pregnant cats do this. I've just taken on a kitty who came from just such a lady-cat who \"adopted\" a friend just before she started to get chubby. Mentioned this to my vet last week and she said it is extremely common for semi-feral queens to seek out humans when they get knocked up.","score":0}]},{"title":"Pretty sure our cat thinks the crib we put together was for him.","url":"http://i.imgur.com/55PhhO1.jpg","permalink":"/r/cats/comments/39yqmh/pretty_sure_our_cat_thinks_the_crib_we_put/","score":4790,"numComments":228,"subreddit":"cats","comments":[{"text":"\"Yes, this will do nicely.\"\nThat smug little expression of kitty joy.","score":4},{"text":"An update: he also likes [the Lazy Boy](http://i.imgur.com/HElgNet.jpg)","score":1},{"text":"Wow. That is a happy cat. Need help putting together the other crib? xD","score":9},{"text":"He's going to be SO pissed off when he finds out that isn't his.","score":-4},{"text":"You mean you didn't?","score":0},{"text":"\"I'm da baby, gotta love me!\"","score":3},{"text":"r/catbellies","score":0},{"text":"\"Look at me, I'm the baby now\".","score":0},{"text":"Of course it's for him.","score":0},{"text":"Just some unwanted advice here, but my cats did this too. \nIf you want to keep them out of it, put some tin foil in the bottom :) ","score":-1},{"text":"An update: he also likes the [lazy boy](http://i.imgur.com/HElgNet.jpg)","score":1},{"text":"Put that mobile on human ","score":0},{"text":"[my](http://imgur.com/a/pKfW6) [cat](http://imgur.com/a/kdmBG) was the same. my son is now 13 weeks old and they are bff's, the cat soothes the baby better then I do -_-\nEdit: \nMy cat hasn't been in the cot since my son was born, she did however get the bassinet as my son hated it.","score":-1},{"text":"Yeah, good luck explaining it to him!!","score":7},{"text":"You have a cat, why would you want/ need a kid?","score":1},{"text":"He looks like the Cheshire Cat\n","score":2},{"text":"The kitty's expression is priceless!  Beautiful cat, too!","score":3},{"text":"He looks so happy.","score":3},{"text":"\"I think you need to get a second one for me. Either that or get rid of that small human you bought\".","score":0},{"text":"I hope your baby finds the cat bed comfy :0)","score":2},{"text":"Your cat looks just like mine! Maine Coon? http://imgur.com/iR881Kz\n","score":2},{"text":"HAHA, our cats spent a month or two thinking that the beautiful soft new room was for them. Little Did They Know.","score":6},{"text":"I'M THE BABY!!","score":0},{"text":"My cat would be so jealous if he knew that I just aww'ed so hard, it brought tears to my eyes.","score":-5},{"text":"\\#catsnotbrats","score":0},{"text":"¯\\\\\\_(ツ)\\_/¯","score":0},{"text":"Oooh, wait til it's occupied. ","score":0},{"text":"\"Guys, I'm so glad you have all these things and attention just for me! I'm so happy I don't have to share it with anybody!\"","score":7},{"text":"I'm a girl, I'm really a little girl!","score":0},{"text":"That is the face of unadulterated bliss. ","score":3},{"text":"now you have to buy a 2nd one","score":0},{"text":"That is by far the cutest fucking picture I have seen. \n\nOh, and it looks like your gonna need another crib ","score":-2},{"text":"[LOOK AT ME!  I'M THE BABY NOW!](http://i.lvme.me/cx2lp7l.jpg)","score":0},{"text":"&gt;Pretty sure our cat thinks the crib we put together was for him.\n\nTrust me, you *did* put the crib together for him, you just don't know it yet. \n\nWell, I hope your baby will enjoy the cat basket. BTW, congratulations! 💙 ","score":6},{"text":"If you have a newborn you need to remove those cushions and any blankets. ","score":0},{"text":"You might want to discourage this behavior. My brother's cat did the same thing before the baby was born and then kept jumping in once the baby took up residence. One night the cat jumped in on the baby's face and really scratched him up. Ultimately the baby was fine, but my brother was pissed.","score":-1},{"text":"Look dat face!!!!! so fricking cute!! and yep, you need another crib lol ","score":5},{"text":"So my cat was exactly the same way. I ended up having to blow up balloons and put them in there to keep him out. ","score":0},{"text":"Welp you have two options:\n\n1) Better put together another one\n\n2) Don't have a baby ;P","score":2},{"text":"It isn't? lol","score":3},{"text":"Beautiful cat. From the looks of it, a rather spoiled one. :)","score":3},{"text":"This is my cat in the future.","score":0},{"text":"/r/floof is looking for this baby","score":0},{"text":"/r/aww would go crazy for this cutie. So adorable, your cat is photogenic! ","score":1},{"text":"Omgthosebellyrubsyesplease","score":0},{"text":"The cat was like, \"Weee... I got a new bed!\" ","score":2},{"text":"Look at that face. It might not have been for him before, but it certainly is now. ","score":0},{"text":"Well now it is. \n\nSource: cat thought my new bed was for him. It wasnt then, but it is now.","score":0},{"text":"Our cats are twins\nhttp://m.imgur.com/GGR96KL,9gN7Vmh,XZa09H3","score":0},{"text":"My cat use to sleep at my little sisters feet in her crib. My mom was worried at first but he was really careful and really loved to be there with her. Free warm feet I guess ..","score":4},{"text":"Dis mine now","score":0},{"text":"He's about to be so disappointed.","score":-2},{"text":"This is the best. What a great picture!\n\nBefore I was born, my parents' long-haired calico Boogen would sleep in my crib. Once I  arrived, she jumped in and was horrified I was in there. I loved her as I grew up but she stayed pretty aloof towards me, haha.","score":10},{"text":"What a magnificent hunk of cat beastie... Dat fuzzy belly! He or she bears a striking resemblance to my dearly missed cat Biggie. ","score":1},{"text":"Yeah you definitely need to either set boundaries now, no pun intended, or get another crib. No other option... well lets not get into the options that are a little to dark for /r/cats","score":-1},{"text":"That kitty is in for a big surprise!","score":1},{"text":"LMAO - Best laugh I had all day!\n\nThanks for posting it.","score":8},{"text":"That's the most i've ever seen a cat smile.","score":2},{"text":"I swear i have the female clone of your cat,  pretty much identical ","score":-1},{"text":"I would smother myself in that furry belly.","score":0},{"text":"Oh my god look at the fluffy snuggles!","score":1},{"text":"Looks like the Cheshire cat. ","score":2},{"text":"The cats in the cradle and the silver spoon","score":0},{"text":"That is the cutest effing thing. ","score":0},{"text":"Your cat ever star in Alice Adventures in Wonderland by chance?","score":4},{"text":"This picture makes the cat look really big or the crib look really small.","score":1},{"text":"Must be nice being a house cat. I'm kind of jealous. ","score":3},{"text":"in da crib","score":0},{"text":"Oh that is just *precious*","score":0},{"text":"Gorgeous Maine Coon! Also kinda looks like Cheshire Cat with that expression.","score":2},{"text":"That's the right baby for that bed.","score":0},{"text":"Another Maine Coon.  Adorable.","score":3},{"text":"Made me laugh,  pretty cute.","score":4},{"text":"What a doll. I'm 32 but I still remember the cat I had when I was very small, he looked just like this one and he was the best!","score":5},{"text":"congratulation! :D","score":2},{"text":"Cats!! So damn cute and hilarious.  So damn allergic.   Fuck you cat!","score":-10},{"text":"So OP how did he take the news when you told him?","score":0},{"text":"bundle of joy!","score":3},{"text":"A trick I read to keep cats out of cribs is to blow up a bunch of balloons and fill up the crib with them.  After a couple of big pops, the cat avoids the crib.  I don't know if this actually works, my cats had no interest in the crib once the little alien invaded it with, the one with the grasping fingers.  A.K.A. my son.","score":0},{"text":"Your cat looks just like an un-grumpy-faced version of my late friend's cat. She is an elderly Maine Coon and was my friend's darling little baby even at more than 10 years old and 15 lbs. I feel like if my friend had ever had the opportunity to have a crib, Patty the Cat would have absolutely claimed it in this fashion.","score":6},{"text":"My cat keeps taking over the bassinet.\n\nWhen I lay him in it she always lays on the bed right by it and waits for him to move. He won't sleep a full night in it, so as soon as I pick him up out of it she gets in it and starts cleaning herself.","score":0},{"text":"That'smy asshole cat, too. Crib, pack n' play, glider, bouncer, play mat. Her fat fuzzy butt is in one of those all the time.","score":-4},{"text":"I will use this picture as my happy thought today.","score":3},{"text":"Look at me! I am the baby now. ","score":0},{"text":"Put balloons in the crib on top of aluminum foil. The next time your cat jumps in, will be the last!","score":2},{"score":0}]},{"title":"\"Get another cat\" they said. \"They'll love eachother\" they said.","url":"http://imgur.com/JPYqbnO","permalink":"/r/cats/comments/3a22la/get_another_cat_they_said_theyll_love_eachother/","score":93,"numComments":9,"subreddit":"cats","comments":[{"text":"I have seen this so many times. They will eventually learn to tolerate each other, but it will take time. Show love to both and they will calm down and maybe even become good friends who love each other, but it won't be an overnight thing.\n\nBiggest mistake I usually see is when people get 2 male cats. Males are more territorial and hate competition. ","score":6},{"text":"LMAO.\n\nGive it a little time. They'll be buds before you know it.","score":0},{"text":"To be honest they look like bros at a party about to high five. ","score":4},{"text":"haha, reminds me of my Sisters cats. They just hissed at each other after she introduced a new kitty to her existing pair, but somehow were to tired to do anything more.","score":1},{"text":"oh this is wonderful. I had two female littermates.. they fought and spat their entire lives.. no one ever got hurt, but they were a couple of cranky old biddes","score":1},{"text":"\"High Five!!\", \"Hugs!!\"","score":2},{"text":"I've got two females, about four years apart.  The older one never accepted the younger one and chases and swats the younger one on a daily basis.  You should see the looks I get when I'm petting the younger one.","score":1},{"text":"Don't worry...they'll chill out eventually. I have an old biddy kitty (13) who hates everyone and we brought home two baby kittens (now 5). They all actually get along okay now and only occasionally swat at each other. None of them cuddle with each other, but they tolerate, which is usually the best you can hope for with cats.","score":2}]},{"title":"I challenges your spelling of feet.","url":"http://imgur.com/k4C2J79","permalink":"/r/cats/comments/3a1ssh/i_challenges_your_spelling_of_feet/","score":66,"numComments":4,"subreddit":"cats","comments":[{"text":"\"Want to see 'feet' - I can show you four of them right now.  Want to see 'feat' - let me out the front door and I'll bring you a dead rodent or bird within the hour.  I've got that gleam in my eye\".","score":-3},{"text":"God, tuxies are so hard to manage. ","score":0},{"text":"That's so cute. He looks like he's seriously contemplating a board move.","score":4},{"text":"Aww looks just like my tuxedo cat Bob! http://imgur.com/gallery/tt9fNM5/new","score":2}]},{"title":"My little man Sinbad at 6 weeks","url":"http://imgur.com/XxecvPa","permalink":"/r/cats/comments/3a1c2t/my_little_man_sinbad_at_6_weeks/","score":90,"numComments":1,"subreddit":"cats","comments":[{"text":"So Darn Cute.","score":2}]},{"title":"Adopted a new cat.. this is only 2 hours after I brought her home.","url":"http://i.imgur.com/MbOCGUv.jpg","permalink":"/r/cats/comments/3a21qf/adopted_a_new_cat_this_is_only_2_hours_after_i/","score":44,"numComments":5,"subreddit":"cats","comments":[{"text":"she knows she's safe around bat dog....","score":1},{"text":"*'So glad to be out of that shelter. I has a home now!'*","score":3},{"text":"She likes the little bell collar!","score":2}]},{"title":"She pants when she gets excited","url":"http://i.imgur.com/5fjAacN.jpg","permalink":"/r/cats/comments/3a1uhh/she_pants_when_she_gets_excited/","score":35,"numComments":6,"subreddit":"cats","comments":[{"text":"Maybe you should look into that. It doesn't seem normal.","score":0},{"text":"My vet told me panting is a sign of illness or generally just the something is wrong. If you haven't talked to your vet I would. I would also get a second opinion just in case. But that just me. :) Wouldn't want the little one to be having troubles!","score":-5},{"text":"Apparently a dog worked his way into the gene pool somewhere along the way.\n\nSeriously though, have her checked by your vet. The other people may have a point.","score":0},{"text":"My cat pants sometimes also when really excited.... he also has a short tail and plays fetch. (And yes, I'm sure it's a cat) ","score":4},{"text":"We were playing fetch guys. Relax. ","score":0},{"text":"Maybe she has cat asthma or something..","score":0}]},{"title":"Hello reddit, meet 7 week old Smokey!","url":"http://imgur.com/7s87AIY","permalink":"/r/cats/comments/3a1ns6/hello_reddit_meet_7_week_old_smokey/","score":30,"numComments":2,"subreddit":"cats","comments":[{"text":"What a Cutie.\n\nI hope you have many happy years together.","score":5},{"text":"pretty eyes!","score":1}]},{"title":"It wasnt until I moved into my new place that I discovered I have ceiling cats.","url":"http://i.imgur.com/1O62Bo7.jpg","permalink":"/r/cats/comments/3a0sw9/it_wasnt_until_i_moved_into_my_new_place_that_i/","score":80,"numComments":2,"subreddit":"cats","comments":[{"text":"i feel like this is blasphemous.","score":2},{"text":"I love the cat's expression!  Enjoy your ceiling cats!","score":5}]},{"title":"Got a sneaky little visitor whilst I was going to the toilet in Italy last summer...","url":"http://imgur.com/a/oq4PK","permalink":"/r/cats/comments/3a101a/got_a_sneaky_little_visitor_whilst_i_was_going_to/","score":57,"numComments":4,"subreddit":"cats","comments":[{"text":"So.. Italy has some weird public toilets, right? Squat toilets really aren't my thing. ","score":-2},{"text":"Me escuse","score":0},{"text":"A peeping tomcat.\n\nOh, wait a second --that's a girl, which makes it even stranger I guess.","score":0},{"text":"La mia bellissima gatta!","score":0}]},{"title":"If I fit, I bask","url":"http://imgur.com/puP7eok","permalink":"/r/cats/comments/3a0rjx/if_i_fit_i_bask/","score":73,"numComments":1,"subreddit":"cats","comments":[{"text":"Aah, a bidet-cat!!","score":0}]},{"title":"Every day she sits up here and stares off into the distance","url":"http://imgur.com/mc1Ov2y","permalink":"/r/cats/comments/3a0tsl/every_day_she_sits_up_here_and_stares_off_into/","score":58,"numComments":3,"subreddit":"cats","comments":[{"text":"If only I'd bought a boat...","score":0},{"text":"Kitty meditation.\n\nAs long as it works for her.","score":0},{"text":"Serious paws!","score":0}]},{"title":"A tail of three kitties","url":"http://imgur.com/a/j50Aj","permalink":"/r/cats/comments/3a1m2c/a_tail_of_three_kitties/","score":21,"numComments":1,"subreddit":"cats","comments":[{"text":"I expected to see a mega tail. Nonetheless i'm sorry for Pushkin you are a good owner.","score":2}]},{"title":"I have to take my kitty I grew up with to the vet to be put to sleep on 14hrs... this guy helped me grow through depression. what a trooper.","url":"http://imgur.com/Mvmtd47","permalink":"/r/cats/comments/3a0kwq/i_have_to_take_my_kitty_i_grew_up_with_to_the_vet/","score":73,"numComments":19,"subreddit":"cats","comments":[{"text":"A peaceful, dignified end is the kindest thing we can give our furry friends.  Hold him close and let him know how loved he is.  My condolences. ","score":5},{"text":"I'm so sorry. Give him a hug and a scritch from me.\n","score":1},{"text":"beautiful cat, i'm sorry for your loss buddy.","score":-1},{"text":"I'm taking my 15 year old there in about 45 minutes.  I've never cried so much in my life over the death of a human than this cat.  He has been my absolute best friend and companion since he was 7 weeks old.  I wish you strength my friend, I know this isn't going to be easy. \n","score":3},{"text":"Thank you for the support guys. I woke up this morning without him on my bed due to him being so weak... I still can't believe it... \n\nLeaving my business today to spend my last hour with him cuddling too. ","score":2},{"text":"I just want to share his story because it's so cool.... On thanksgiving in the fourth grade my dad came home from working in a construction yard, with this kitten. The kitten was so malnourished due to being stuck in a tire rim and abandoned by his family. My parents told me not go get my hopes up as he seemed very I'll,.. But we put him in a big crate and fed him and I played with him overnight. I remember running out of my bed to see we him when I woke the next morning... And he was perfectly awake playing in his crate. Fast forward 11 years of companionship, struggle, and hard times growing up... He got me through it all. I'm so thankful I was able to grow up with him. He signifies so many moments in my life ... Damn... Sorry guys. ","score":-2},{"text":"Hang in there!","score":0},{"text":"What a handsome cat and a good friend.","score":3},{"text":"My condolences. Hugs to you both.","score":2},{"text":"Don't have her put to sleep unless she's deathly ill. Let nature take its course.","score":-2}]},{"title":"My Little Man","url":"http://imgur.com/HdzSUIu","permalink":"/r/cats/comments/3a20l7/my_little_man/","score":13,"numComments":2,"subreddit":"cats","comments":[{"text":"duh - everyone knows that a cat can see your soul.","score":0},{"text":"Cute.","score":2}]},{"title":"Callie turned 1 a couple weeks ago","url":"http://imgur.com/UAoMgG6","permalink":"/r/cats/comments/3a1ynh/callie_turned_1_a_couple_weeks_ago/","score":13,"numComments":0,"subreddit":"cats","comments":[]},{"title":"These idiots were stuck in the wiring of an outdoor sofa, with their mom crying around it for a day. Had to cut open the cushions.","url":"http://i.imgur.com/aUSCtUW.jpg","permalink":"/r/cats/comments/39w87k/these_idiots_were_stuck_in_the_wiring_of_an/","score":4218,"numComments":161,"subreddit":"cats","comments":[{"text":"Bonus: the one that caused all the trouble: http://imgur.com/pBkvP51 other two we could reach in and get out. this one was completely wrapped in the wires. \n\nThere were 5 of them originally (http://imgur.com/a/xp5jO) but their mother moved them away from our backyard a while ago. Couldn't find them. Apparently she moved them to a neighbor's shed, two of the kittens could not make it. And the remaining 3 got out recently, only to get tangled in a sofa. Luckily their mom has a strong voice. Vet has them now for adoption, mom got spayed.","score":4},{"text":"Best way to get a cat out of a tight space is to lure it out with another cat. If that one gets stuck, send in another cat! - Charlie","score":1},{"text":"First cat gets stuck. Sibling goes in to help, gets stuck. Third sibling goes in to help the others, gets stuck...\n\nFirst cat: *Now what?*","score":0},{"text":"I've held one kitten before.\n\nWonder what it's like to hold three?","score":2},{"text":"I love their look of, \"we shouldn't be in trouble for this, it wasn't our fault!\".","score":1},{"text":"http://i.imgur.com/MVd7rCv.jpg","score":0},{"text":"Definitely the cutest idiots I'm going to see today!","score":0},{"text":"Thank you for sacrificing your sofa for these daft meowzers","score":2},{"text":"I'm naming the instigator Frank. He looks like a Frank. I don't know a single Frank that could stay out of trouble. Frank's going to end up in kitty Sing Sing one day where he convinces the other kitty convicts to burrow through the litter pan to freedom. \n\nI like Frank. ","score":5},{"text":"\"These idiots\"","score":0},{"text":"That is how I got my two, from a bush in front of Food Lion. One went in and hid, the brother followed. One brother howled until we rescued them. Though momma wasn't around because they were abandoned. :(","score":-1},{"text":"3/3 would keep","score":0},{"text":"I need that gray one.","score":-1},{"text":"Long live and prosper.","score":0},{"text":"Where does one find wiring in a sofa? ","score":0},{"text":"They appear to have no regrets.","score":-3},{"text":"It's all fun and games until you get a few cats stuck in the couch.","score":2},{"text":"Glad you got them out. ","score":3},{"text":"They are super cute!  Good on you for rescuing them and finding them a shelter.","score":8},{"text":"Is mama cat being adopted too? Or is she too used to the feral life to do so?","score":0},{"text":"Im excited that mama stuck around and is doing well (after hearing about your crappy neighbor in the first post)!","score":1},{"text":"Kittyots ","score":0},{"text":"They are far too adorable to be idiots!","score":3},{"text":"Idiots?  ","score":0},{"text":"kitten's are the definition of ADHD i've come to learn.","score":0},{"text":"Thank you","score":2},{"text":"Wish I could have the grey one - it looks like one I had that died about 6 weeks ago!  They are all so cute.","score":1},{"text":"Well at least they're free and safe =^_^=","score":2},{"text":"I've had to do that. But it was still better than ripping a sofa apart to remove a boa constrictor. At least kittens WANT to get out--the snake just clung to everything.   But at least the kittens weren't in the sofa at the same time as the snake.","score":3},{"text":"Dumbelly dumbheads sounds nicer than idiots.","score":0},{"text":"Moe, Larry and Curly.","score":0},{"text":"\"We fucked up bad\"","score":-7},{"text":"I need that gray one. Someone get me a cute gray cat STAT.","score":0},{"text":"Why can't I hold all these cats??","score":0},{"text":"Kittens love trouble. My kitten just took a bath in the toilet. I now call her toilet cat.","score":1},{"text":"I wouldn't call cats idiots if I were you.  They know these things and hold grudges.","score":0},{"text":"adorable idiots though","score":3},{"text":"The Three Stooges live!","score":0},{"text":"Adopt them all!","score":1},{"text":"Absolutely love it when people call cats idiots. I also love my two idiots. Smart as hell, but still idiots. ","score":3},{"text":"Well, at least they have names now: Moe, Larry and Curley.\n\n","score":0},{"text":"Interesting.  Ive never heard that there i a correlation between color and personality.  Is there a known genetic basis for this?  Do other colors have typical personalities?  What about tuxedos?  Orange cats?","score":2},{"text":"Good thing the momma cat didn't leave them alone and kept crying until help came. They're so cute and cuddly!","score":2},{"text":"bless their pathetic little hearts. ","score":0},{"text":"Little stupids.","score":0},{"text":"Gray Kitten:  Longer than you think!!","score":-1},{"text":"Idiots.","score":0},{"text":"Stupid cats","score":-2},{"text":"[deleted]","score":0}]},{"title":"This is what I wake up to!","url":"http://imgur.com/OQZH1Xa","permalink":"/r/cats/comments/3a0qja/this_is_what_i_wake_up_to/","score":45,"numComments":4,"subreddit":"cats","comments":[{"text":"You know it will be a good day when the first thing you see is your cat sleeping next to you  :-D ","score":3},{"text":"Adorable.","score":3}]},{"title":"\"Can you feed me now?\"","url":"http://i.imgur.com/LrMqc3W.jpg","permalink":"/r/cats/comments/39xbcj/can_you_feed_me_now/","score":1021,"numComments":11,"subreddit":"cats","comments":[]},{"title":"Our fuzzy ginger kitties wrastlin'","url":"http://i.imgur.com/Ju0QnPa.jpg?1","permalink":"/r/cats/comments/3a20eu/our_fuzzy_ginger_kitties_wrastlin/","score":10,"numComments":0,"subreddit":"cats","comments":[]},{"title":"When you live in the countryside and you have 5 cats...this becomes a thing.","url":"http://imgur.com/xhsidQS","permalink":"/r/cats/comments/3a1nis/when_you_live_in_the_countryside_and_you_have_5/","score":13,"numComments":0,"subreddit":"cats","comments":[]},{"title":"I just love her raccoon tail...","url":"http://i.imgur.com/x6F2Y8g.jpg","permalink":"/r/cats/comments/3a079b/i_just_love_her_raccoon_tail/","score":77,"numComments":3,"subreddit":"cats","comments":[{"text":"Giving you the \"try it. I dare you look\"","score":0},{"text":"She needs to be brushed and groomed. ","score":0},{"text":"Smart getting carpeting that sort of matches the cat fur. Does she love to get brushed?","score":4}]},{"title":"Sleepy kitty","url":"http://i.imgur.com/bZfIFPK.jpg","permalink":"/r/cats/comments/3a200p/sleepy_kitty/","score":9,"numComments":0,"subreddit":"cats","comments":[]},{"title":"My cat loves the selfie","url":"http://i.imgur.com/NnHp8pe.jpg","permalink":"/r/cats/comments/3a0uxi/my_cat_loves_the_selfie/","score":27,"numComments":1,"subreddit":"cats","comments":[{"text":"He knows he takes good pictures, that's why.","score":3}]},{"title":"This is how she likes to sleep","url":"http://imgur.com/vCjdl26","permalink":"/r/cats/comments/3a0993/this_is_how_she_likes_to_sleep/","score":54,"numComments":2,"subreddit":"cats","comments":[{"text":"She looks like my little kitten! Except my cat is a spawn of hell and is currently attacking my ass. ","score":-7},{"text":"That's a happy, content cat.\n\nNot to mention Cute.","score":5}]}]},{"subreddit":"dogs","posts":[{"title":"[RULES] Please read before posting. See inside for updates on our subreddit's organization.","url":"http://www.reddit.com/r/dogs/comments/396fm0/rules_please_read_before_posting_see_inside_for/","permalink":"/r/dogs/comments/396fm0/rules_please_read_before_posting_see_inside_for/","score":33,"numComments":7,"subreddit":"dogs","comments":[{"text":"Are soliticing for money posts going to be allowed? I am not sure if these rules are meant to entirely replace the old rules but I just saw a post asking for donations last night and I am really hoping that the rule banning them sticks.","score":2},{"text":"There was a poll?","score":0}]},{"title":"[Help] Stressed Dog","url":"http://www.reddit.com/r/dogs/comments/3a191g/help_stressed_dog/","permalink":"/r/dogs/comments/3a191g/help_stressed_dog/","score":25,"numComments":12,"subreddit":"dogs","comments":[{"text":"Is she crate trained? There was construction in front of my house for a couple of months earlier this year and I made sure my dog was in his crate when I left. It's his safe spot, I threw a blanket over it to muffle the sounds, and I didn't have to worry about him destroying things out of stress/frustration. ","score":-5},{"text":"Do you have a kong to give him to get his mind off the noise and onto getting some peanut butter or cheese out of the middle of the toy?","score":0},{"text":"Act normal. I can't stress this enough. Don't let your dog think that this construction is anything but normal. Instinctively we want to make our furry friends feel better by comforting them but this can actually reinforce their nervous behavior. Instead try and distract them with toys, food, or playtime (kongs filled with peanut butter are great for this). When you have to leave I would crate your dog, assuming you have already done crate training. That way they can't hurt themselves or your things.","score":1},{"text":"Good ideas here; my advice would be to allow your dog to be in a place that feels like a hiding spot, but not a prison; like, maybe inside a dark but open closet or under a bed.","score":5},{"text":"I recommend the following anxiolytics to dog owners in the event of construction, fireworks, or general anxiety:\n\nRainbow Light's Green Dog Natural line \"Complete Calm\" (see below)\n\nhttp://www.petherbsdirect.com/product_info.php?products_id=405&amp;gclid=CJC16b7klMYCFVFefgodP0oAog\n\nOR \n\nK9 and Kitty Calmer by liquid health naturals (It likely has a 3/5 rating because it does stink as it's made with beef liver and it's a liquid but it does work!):\n\nhttp://www.amazon.com/K9-Kitty-Calmer-Liquid-Health/dp/B0084KDHX0\n\nI think if your dog is used to having a little crate as like a comfortable little den/fox hole then that could work also. \n\nI've never crate trained my dogs as I personally feel it would be anxiety inducing but for many owners and trainers they highly recommend it and I've seen it work in some dogs. \n\nAlso considering you're in a new apartment anxiety can cause dogs to destroy things so you may want to give him or her a mild dose of the anxiolytic and also put them in the crate for a few hours (if this is where they feel most comfortable).\n\nHope that helps :)!","score":7},{"text":"I don't know if this is really a good idea but I'd take a bunch of her favorite treats and go up to the roof with her. Maybe once she understands the source of the noise, she will calm down. I know I would if it were me.","score":7}]},{"title":"[Fluff] My dog just saved a bird","url":"http://www.reddit.com/r/dogs/comments/3a28o7/fluff_my_dog_just_saved_a_bird/","permalink":"/r/dogs/comments/3a28o7/fluff_my_dog_just_saved_a_bird/","score":10,"numComments":5,"subreddit":"dogs","comments":[]},{"title":"[Help] Dogsitting a Bichon Frise, doing 'funny' things while submissive. What do they mean?","url":"http://www.reddit.com/r/dogs/comments/3a1h2d/help_dogsitting_a_bichon_frise_doing_funny_things/","permalink":"/r/dogs/comments/3a1h2d/help_dogsitting_a_bichon_frise_doing_funny_things/","score":14,"numComments":4,"subreddit":"dogs","comments":[{"text":"It all sounds like play to me!  Play-biting is very common, and as long as she's not biting hard, I wouldn't be worried about it. Additionally, some dogs are very \"pawsy\" and like to use their paws to express themselves. One of my dogs does something similar with her paws when I rub her belly.  As best I can tell, it means \"that feels good, I'm just going to stretch out and enjoy the belly rubs\".","score":8},{"text":"My parent's bichon does the same thing, rubbing at his eyes with his paws, we've actually got it down to a command and he'll do it when asked now (we call it 'Be cute'). He does it on his own when he wants his belly rubbed. It's kind of a bashful, look at me I'm so adorable, pet my belly type thing.\n\nAs for little nips, my pup will play nip at you if you rub his belly, I think sometimes it's ticklish or they kind of are inviting you to go from just belly rubs to full-out play.","score":6},{"text":"She wants to play. Get down on the floor and use your happiest, sing-song, voice you use with little kids when you play with them. Snuggle, rub her belly, play tug, fetch, tell her what a good girl she is. Most importantly... have fun with it.","score":7},{"text":"Fleaing is almost always affectionate.","score":3}]},{"title":"[Help] Can't find many 3XXL+ harnesses for my Pyrenees!","url":"http://www.reddit.com/r/dogs/comments/3a1lnm/help_cant_find_many_3xxl_harnesses_for_my_pyrenees/","permalink":"/r/dogs/comments/3a1lnm/help_cant_find_many_3xxl_harnesses_for_my_pyrenees/","score":12,"numComments":10,"subreddit":"dogs","comments":[{"text":"Less than $25 is a tight budget for a large harness. I was going to suggest Julius K9 but that's a bit out of your range.\n \n\n[Comfort Flex](http://www.thedogoutdoors.com/comfortflex-padded-quick-fit-dog-harness.html) is around $30, but their XXL should fit your dog. I've heard both glowing reviews for the product and some \"meh\" reviews.","score":3},{"text":"Ruffwear makes harnesses that fit Great Danes maybe check them out.","score":4},{"text":"I'm going to second Ruffwear, although price and colorwise they're not what you're looking for. Great quality though. Love the backpack/shoes/jacket I got from them.","score":6},{"text":"I would take a look at a Lupine harness (which definitely goes up to your size) and pair it with a pretty scarf or a big flower accent for her collar.","score":2},{"text":"I don't think you're going to find anything that meets all your criteria (42\" chest, cheap, girly, vest style). I think you're going to get MAYBE one of those other than \"it fits on your dog\" if you're lucky.\n\nI think your best bet would be a [Julius K9 harness](http://www.cleanrun.com/index.cfm/product/3301/julius-k9-idc-harness.htm). It's more than double your price range, the selection on Amazon is limited so you'll almost certainly have to order from somewhere else, and it doesn't come in patterns. But it is vest style, comes in pink, purple, light blue, and \"kiwi\", and will fit on your dog.\n\nI'm pretty sure a vest-style harness big enough for a Pyr with a 42\" ribcage costs ~$25 in just materials.","score":5},{"text":"I would go on etsy and contact someone making them.  I've found sellers on there are very willing to customize.  It will probably cost more than $25 though.","score":0},{"text":"It's a little outside the price range you're hoping for but you should try one of these http://www.harnesslead.com/\n\nThey're a one piece leash/harness combo that can be adjusted to fit any size dog","score":3}]},{"title":"[HELP] About to get my first dog ,German shepard/labrador mix. Any tips/advice ?","url":"http://www.reddit.com/r/dogs/comments/3a1u98/help_about_to_get_my_first_dog_german/","permalink":"/r/dogs/comments/3a1u98/help_about_to_get_my_first_dog_german/","score":9,"numComments":17,"subreddit":"dogs","comments":[{"text":"Are you getting him/her from a shelter? Do you know anything about the dog's background?\n\nMake sure you have enough time to be home every 2-3 hours for housebreaking, or can hire someone to come that frequently. ","score":0},{"text":"Where are you getting the dog? How old is it? ","score":0},{"text":"It's really hard to say what that breed mix will be like, because German Shepherds and labs are pretty much opposites on the temperament spectrum. The dog will likely be high to very high energy and fairly large (50+ pounds), but beyond that, it's really hard to say.\n\nHow do you protect your furniture?  Supervise when you can, crate the dog when you can't, and lots and lots of exercise, mental stimulation, and training. Every. Single. Day.","score":2},{"text":"I've got a shelter dog, she looks like a GSD, acts like a lab/pitbull mix, and plays rough as all heck.  You are in for a lot of fun!  However, if she/he does have some GSD and lab in her, she may be a heavy chewer.  I would recommend getting some heavy duty toys for him/her (for instance, we use the black extra strength kongs because she's so tough she bit right through the usual ones...).  \n\nAs for preserving furniture, there are a number of sprays and such that you can get, but I found they didn't really work that great until we hit on the right one.  So, try them all and hopefully they work quicker for you than they did for us!  \n\nHave fun!  ","score":21},{"text":"Our last dog Sophie, was a lab/shepherd mix and she was wonderful.  Smart, easy to train and loved the woods and swimming.\n\nNow when she was teething, she did eat the corner off an antique wooden table, which we still have.  The missing corner and teeth marks reminds us of her.\n\nThe only advice I can give you is premium quality dog food is worth the price and make sure you give her plenty of chances to run and play with other dogs.\n\nCongratulations!","score":11}]},{"title":"[Vent] Why the HELL would you take your dog to the vet on a Flexi?","url":"http://www.reddit.com/r/dogs/comments/3a111o/vent_why_the_hell_would_you_take_your_dog_to_the/","permalink":"/r/dogs/comments/3a111o/vent_why_the_hell_would_you_take_your_dog_to_the/","score":18,"numComments":33,"subreddit":"dogs","comments":[{"text":"&gt; I know I've read here that some people think that the vet's office is a good way to socialize their dogs.\n\nI've never actually heard this here.  And...I'm kinda on here way too much.\n\nWhat I *have* heard is taking your dog into the waiting room of the vet and getting them to be ok with the vet.  Maybe get on the scale, get some treats, and maybe a pet or two from the receptionist.\n\nBasically, counter conditioning the vet's office.  I did this once or twice (and then my dog had to come in for a cold laser treatment on her leg which doesn't hurt at all so we were there twice a week for 4-ish weeks and she's pretty fine with the vet now) because my dog freaked out at the vet.\n\nI've never heard of anyone saying to let their dog meet other dogs at the vet.","score":4},{"text":"I think having them on a flexi is fine if you lock the damn thing. My dog can get pretty excited/aggressive around other dogs(no idea why, she seems to decide who she likes or absolutely hates on sight) but I don't just let her bother other dogs. That lady just sounds irresponsible. ","score":-2},{"text":"That is **so** frustrating. I was at the vet's office last week and a guy came in walking his two pulling German Shepherds by their collars. At least they were close to him, but they were whining, barking, and pulling him all over the place. Why wouldn't you just come in first, get some slip leads from the receptionists, and go back out to bring your dogs in one at a time? You couldn't even open the door to yourself, and you still thought this was a good idea??\n\n&gt; I know I've read here that some people think that the vet's office is a good way to socialize their dogs. Whatever: that doesn't include interacting with my dog, who was not put on this earth to teach anyone else's dog anything at all.\n\nI don't think people usually recommend vet's office for socialization other than for dogs that are scared of the vet. They're not going there to socialize with other dogs, but rather, to understand that not ever trip to the vet is going to result in shots and strange people grabbing you all over. A dog that is going to the vet for a socialization visit should still be well-behaved enough to not interact with other dogs there. ","score":3},{"text":"I work in a vet. I'll take flexis! Please! Half our clients walk in with their dog with no collar or lead. I've had people carry in cats on their shoulder or on a cat lead. Into a room full of dogs.\n\nOnce, we opened the front door to a lone dog who had an appointment for blood work. No owner in sight. We put him down the back and in waltzes the owner five minutes later- \"Oh sorry I was getting a coffee. Didn't think you'd open the door for him.\"","score":-4},{"text":"Probably the same people who use Flexis with prong collars. I've also seen people bring their dogs to be groomed on several Flexis --- which not only seems dangerous because every time they will wind themselves around their owner or another dog.\n\nOnce Apollo was attacked at a PetSmart by a Boxer on a Flexi. The only reason he stopped short was because he wrapped himself around an endcap and tipped it over on itself. just inches away from Apollo and I.\n\nThe owner had an armful of dog food cans and wasn't paying attention.\n\nI think Flexis have their usefulness if you live in an apartment and want to let your dog wander when they go to the bathroom, or if you hike and want your dog to be able to wander, but for god sake they come with a lock option, use it!","score":3},{"text":"Our dog was at the vet because he'd been chomped in the leg and it was infected. So, he's running a fever and generally feeling like poo. Door opens. In walks a yorkie. Yorkie keeps coming, right for my dog who's flopped out on his side (my husband had the leash). I get up. Yorkie's still coming. I pick up the yorkie and greet the old woman when she comes in. In her defense, she should've had someone with her.\n\nThis is at our regular vet. There's this dog (white shepherd I think) pulling at his leash, barking and snarling. The idiot owner is standing there with me braced and holding my dog, telling me that their dog is friendly. Now, if you're going to have a dog fight, the vet is the place to do it. Still, seems like a bad idea to me. The vet was so exasperated with the owner, he had to take a break. Hopefully that dude raised his kids better than he did his dog.","score":5},{"text":"I'm one of those that takes their dogs to the Vet's office periodically to ensure that they are always comfortable there. This comes from working with a few skittish rescue animals. Naturally, we encounter many other dogs, and some cats, when we are there.\n\nHowever, two things are different for us than for the lady the OP wrote about. First, our dogs are trained, and will not charge another dog for a greeting. Secondly, whenever we encounter other on leash pets I *always* ask if that owner and its dog(s) are ok for a meet and greet.\n\nMost folks are up for that, but sometimes they decline, and that is exactly why I ask. Some dogs are not friendly, or well behaved, and considering we are in the Vet's office there is a chance that any of them are sick, injured, or dying, and don't need to be messed with.\n\nThis makes us hanging out at the Vet's a non-issue, and we are invited back every time.","score":4},{"text":"In the past I always used a Flexi. You can lock them easily. It's not hard. And when locked they assume the form and function of any kind of leash. \n\nI think what you are against is people who fail to control their dogs in some manner when in a close situation with other dogs. In this instance, you make a good point. One must be considerate to others. Nevertheless, your target, the Flexi, is not the problem.","score":0},{"text":"I've had this happen at PetSmart. With my very large pit mix at my side, a man and his tiny fluffy dog on what must have been a 25ft retractable allows it to walk right up to mine. The tiny dog barks and nips at mine. My dog lets out a deep growl. When I get to the register, the cashier asks if my dog doesn't like other dogs. I told her he most certainly doesn't like dogs who tries to bite him.\n\nAs far as the vet goes, my vet has a cramped waiting room and I always go inside first without my dog and ask if the coast is clear. They have a sign with leashes hanging on it that says all dogs must be leashed.","score":5}]},{"title":"[Breeds] Looking for a breed of dog with good face genes, good agility and quick learning abilities. Details inside.","url":"http://www.reddit.com/r/dogs/comments/3a104t/breeds_looking_for_a_breed_of_dog_with_good_face/","permalink":"/r/dogs/comments/3a104t/breeds_looking_for_a_breed_of_dog_with_good_face/","score":19,"numComments":70,"subreddit":"dogs","comments":[{"text":"**I was friendily recommended to fill out a questionnaire, as that could make it easier for you guys to help me. Here it is:**\n\n&gt;* Do you have other pets?\n&gt;\n&gt;Yes, I have two 2 kakadu parrots. One is an albino.\n&gt;\n&gt;* How much shedding, barking, farting and drooling can you tolerate?\n&gt;\n&gt;No problems with shedding, barking or drooling. Zero tolerance for farting. However, I will try to offer the dog the best diet possible, to minimize farting.\n&gt;\n&gt;* What size of dog are you looking for?\n&gt;\n&gt;The only preference is that it is capable of reaching high speeds, so probably one with long limbs. But no general preference.\n&gt;\n&gt;* How much grooming do you want to do, or how often can you pay a professional to groom him?\n&gt;\n&gt;I can learn and do grooming whenever necessary. I wont pay a professional.\n&gt;\n&gt;* What's your activity level? How much time a day can you give to walking and playing with the dog?\n&gt;\n&gt;Essentially endless, as my job requires me to be personally active. I.e. I can run and play with a ball with the dog every day, just as I do it alone now. \n&gt;\n&gt;* How often will the dog be left alone? If needed, could you hire someone to walk your dog when you can't be home, pay for a doggy daycare, or come home at lunch to break up the day for him?\n&gt;\n&gt;Hard to say, as my daily routine is not very consistent. I could hire someone, or ask my cousins for help. They live across the street, and are essentially me from 10 years ago.\n&gt;\n&gt;* How trainable does your dog need to be?\n&gt;\n&gt;As trainable as possible. This is a top priority. I mean, I'd get a dolphin if he had proper limbs.\n&gt;\n&gt;* Do you live in an apartment? Are there breed or size restrictions?\n&gt;\n&gt;I live in a house, no restrictions. Also have a small garden, I think thats an advantage.\n&gt;\n&gt;* Do you have a fenced yard, or is there a large fenced area nearby? \n&gt;\n&gt;~2m fence. (~6'7\")\n&gt;\n&gt;* Do you have young (i.e under ~8) children?\n&gt;\n&gt;Nope. Not planning to. Prefer a dog.\n&gt;\n&gt;* Are you experienced with owning/training dogs?\n&gt;\n&gt;I have experience owning (and attempting to train) parrots. None with dogs, sadly. Time to amend that :)\n&gt;\n&gt;* Are you easily frustrated or stressed? \n&gt;\n&gt;With humans yes. With animals nope. If it were possible to replace my boss with one of my parrots, I'd be a stress-free guy.\n&gt;\n&gt;* Where do you intend to keep your dog?\n&gt;\n&gt;Not sure what I should write here. He will be kept at home, with option to go to garden whenever necessary. He will be the man of the house, with access to all rooms and couches.\n&gt;\n&gt;* What's the weather like where you live?\n&gt;\n&gt;Pretty shit. Mostly overcast.\n&gt;\n&gt;* Have you budgeted for your new dog?\n&gt;\n&gt;First time the language is a barrier in this questionnaire :( does that mean if I have created a budget for the dog, i.e. estimated dog-related expenditures? No. But that should not be a problem. Unless they are REALLY higher in upkeep then I imagine.\n&gt;\n&gt;* What are you looking to get out of your dog? (i.e a running buddy, a lap warmer/companion, guard dog.\n&gt;\n&gt;My life consists of interactions with two species: humans and parrots. I would like to form a lasting friendship with something in-between the two. That's the main priority. (also: yes, very much running buddy. guard dog not really, as I said I have two kakadus.)\n&gt;\n&gt;In addition, I do not EXPECT him to like those, but if he could do any of those, it would be a huge bonus:\n&gt;\n&gt;\\- Play keepy uppies with a football ball\n&gt;\n&gt;\\- Sit patiently in front of a TV for 90 minutes. (even bigger bonus: get excited when the right team scores)\n&gt;\n&gt;\\- Form a relationship based on respect &amp; trust with my kakadus. The kakadus do not live in a cage, therefore it is of upmost importance that the dog has enough self-discipline not to eat them.\n\n*Sorry its so long, but thats how long the questionnaire is. I used the shorter one of the two, anyway. Hope you will be able to offer me some advice based on that :)*\n\nThank you very much in advance.","score":8},{"text":"Do you have a Facebook?  [If yes, ask to join this group](https://www.facebook.com/groups/CanineConditioning.BodyAwareness/?fref=ts).  They have a huge amount of resources dedicated to helping people teach their dogs to be massively athletic.  You will find that most of the dogs in the demo videos are Australian Shepherds and Border Collies, but a lot of dogs can do these sorts of tricks.  \n\nBully breeds have very durable faces and LOVE pleasing their owners and can get totally ripped and do impressive athletic stunts, but they also are prone to dog aggression, which is quite a shock for unprepared owners and can be extremely difficult to manage.  They don't learn quite as fast or as well as herding breeds but have a lot of instinct and drive that works to the trainer's advantage.  A well-kept bully breed is damn impressive.  The dog in the video is some sort of bully breed mix.  \n\nHerding breeds are athletic, agile, very smart, and love learning.  They are very active in both body and mind and usually need training in addition to physical activity every day.  Australian cattle dogs (also know as heelers and ACDs) are tough as nails, very active, enthusiastic, and some of the most successful trick dogs. They have a tendency toward aggression as well, especially when they're chronically under-stimulated.  This is in contrast to Border Collies which become nervous, anxious, and neurotic when they're under-stimulated. \n\n","score":9},{"text":"There's a better quiz you can answer in the stickied (green post at the top of r/dogs hot page) that will better help us figure out what breed for you. The problem with very intelligent breeds (Aussies, Border Collies, GSD) is that they are also very high energy and have very high working drive which often means they are not suited for first time owners. \n\n\n\nEdit: here's the link, fill it out and I'll get back to you. http://www.reddit.com/r/dogs/comments/338hpq/where_is_that_checklist_of_questions_you_all_like/cqii0b1","score":6},{"text":"Standard poodle sounds like it would be outstanding for you, don't let the poodle part fool you, the standards are incredibly athletic dogs.  Just look for one from a kennel that works their dogs.","score":5},{"text":"One thing to keep in mind is if you get a young dog it will be some time before you should take them running. Running with a dog at too young of an age will damage their joints.   \n  \nUsually I hear that a dog should be 18 months old before taking them running.","score":-3},{"text":"I have an aussie and I think she could learn this. We play monkey in the middle with her and she never gets sick of chasing the ball.","score":-2},{"text":"Instead of getting caught up in the etymology of the word \"breed\" or lecturing on not getting high energy breeds, when you seem high energy yourself, I'll answer your question of a few breeds you should look into. It's on you to do some research, go find someone with these dogs, and see if it's a good fit. No dog is guaranteed to have any trait, so get a puppy from a breeder you trust and can see the parents or its line, or look into getting a year old dog (from a shelter or not) so you can see how the dog itself does.  \n\nBorder Collie or Shetland Sheepdog. High energy, love to herd.  Not the best with uncontrollable kids but you said that's not a problem. They will turn destructive if you don't keep them active. I wouldn't leave them at home uncrated without supervision unless you like taking the chance they tear up your couch.\n\nPoodle. Not my favorite dog, bit some people love them. Smart, energetic, they like the water.\n\nAustralian cattle dog is my personal recommendations for you.  Good size, friendly, good energy level. Again, you must keep on the workouts, or they'll turn destructive. Plus you can feel like Mad Max.\n\nI can list some maybes if you like, mostly the guard dogs. They're smart for a reason, and like being active, but they can be  aggressive, and since this is your first dog, I would worry about your ability to overcome it.\n\nGo to a shelter or get a few good breeds and go meet a breeder. If you go and meet one you like, then theres nothing wrong with any dog you find. Go play with some dogs.","score":27},{"text":"What country are you in? Sounds like you would be a perfect match with one of the bull breed crosses you get in most shelters. I know not every country had shelters though.","score":5},{"text":"dogs don't have 'races' they have 'breeds'.  Only people have 'races'.\nAlso, it's great that you want to play with your future dog and learn, but don't get it based on the fact that you want it to play this specific game with you.  There are breeds that are very fast, smart, durable, and have high energy demands, but most people will not recommend them for you as a first time dog owner.  It's a cool video BECAUSE it's so uncommon.  You might be able to teach a dog to do that, but it would be especially difficult if the dog doesn't like it, and in some cases you might be able to teach it but the dog might not ever like it as much as that dog does.  It's the same with people, some people like to swim, others like to play soccer.\n\nThere is a questionnaire on the right you can fill out to help determine what kind of breed would be best for your lifestyle, I'd suggest filling that out and posting it first and then go from there to get some ideas on breeds.  Just don't go in to it with the idea that any dog would be able to learn that game and be disappointed if it can't.\n\nI don't even know how a dog would be able to do 'around the world' or what exactly a 'handstand rear keepy uppie' even is...sorry.","score":20},{"text":"check out Catahoulas","score":0},{"text":"I would recommend a standard poodle.  If you want an energetic, smart dog that loves to run, play games and learn, they're it.  They don't have much in common with people's preconceptions based on smaller lap dogs.  \n\nThey're actually similar in temperament to a labrador, but they're faster runners and smarter.  They have a very \"human\" sort of intelligence - playful, empathetic and very interested in interacting with people.  Poodles love to be mentally stimulated and crave play, learning tricks, puzzles and exercise.  They have moderate prey drive (LOVE to retrieve - have never known a standard poodle that didn't play fetch with gusto), but somewhat less energy than herding breeds like Border Collies that basically require a \"job\" or they will drive you crazy.\n\nThey have fabulous personalities and few downsides, apart from the fact that they require more grooming than most breeds.  If you're willing to use a pair of clippers to shave the dog every 4 weeks or so, it should be no problem.  You can go with a utilitarian sport clip with the hair all shaved to the same length, or a kennel clip (which has fluffy head/ears and tail with short body/legs/etc).  The grooming isn't that hard - my wife and I figured it out and did an acceptable job on our first try using a $20 clipper.  No big deal!\n\n","score":23},{"text":"I would look for a pound puppy/mutt if I were you. You don't care about looks and there are plenty of pound pups that have working breeds mixed in and are highly intelligent with the kind of face you want. Mixed breeds also have the best health.\n\nMaybe also look into Black mouth curs. They are extremely intelligent and very eager to be trained and have a very durable face. Some people say don't get a hunting dog, but I believe any dog will be fine with your parrots if you train them right and get them as a puppy. Mine is fine with small animals because he is obedient to me. He is also very laid back when we aren't doing anything, and he was great when I lived in an apartment. However, do not skip puppy training classes with black mouth curs. Because you don't have much experience with dogs, I would highly recommend doing puppy training classes with whatever dog you get. You can research a ton about how to train your dog, but nothing beats professional help.\n\nYou could also look into a standard poodle mix (maybe a shepadoodle). Poodles are the best dogs out there.\n\nYou might also want to carefully consider your dog's gender.","score":29},{"text":"Although there are probably certain breeds will meet most of your requirements, as an alternative to \"buying a breed\" you might want to check out local shelters that have mixed breed dogs that are already partially grown or even adult. The shelters will allow you to spend time with them before adopting so you can get an idea of how closely an individual dog meets your desires. \n\nIt's true that breeds tend to have certain personality traits, but you are not 100% guaranteed that the pure bred puppy you buy will display all those traits when it grows up. Being able to actually spend time with a semi mature (8-12 months) or mature dog might be easier to find that energetic, trainable, football dog that you want. ","score":13}]},{"title":"[Help] My dog's undercoat is missing from his side","url":"http://www.reddit.com/r/dogs/comments/3a1hoe/help_my_dogs_undercoat_is_missing_from_his_side/","permalink":"/r/dogs/comments/3a1hoe/help_my_dogs_undercoat_is_missing_from_his_side/","score":9,"numComments":8,"subreddit":"dogs","comments":[{"text":"He may be shedding his puppy coat. It's not uncommon for dogs to go through an awkward in-between phase when that happens. It *could* be a sign of health problems, but I wouldn't worry about it too much unless his skin looks bad (red, scabbed, scaly, etc) or if he is showing other signs of being sick.","score":-12},{"text":"What kind of brush are you using? It's possible you may have brushed out the undercoat with something like a furminator or undercoat rake.","score":4},{"text":"What did your breeder say when you mentioned it to them?","score":0}]},{"title":"[Help] We just adopted a senior dog, and she is great but....","url":"http://www.reddit.com/r/dogs/comments/3a1pbh/help_we_just_adopted_a_senior_dog_and_she_is/","permalink":"/r/dogs/comments/3a1pbh/help_we_just_adopted_a_senior_dog_and_she_is/","score":7,"numComments":10,"subreddit":"dogs","comments":[{"text":"On the cat issue - how long is \"since you brought her home\"? Can you confine the dog to one room for a while to give the kitties time to adjust? Can you put a litter box, food, and water upstairs somewhere they can get to? These don't have to be permanent solutions but they can take the pressure off during the time it takes for all pets to get used to each other.\n\nOn the fiance issue - second guessing or immediate buyer's remorse is normal. I'd say give yourselves some time to see how everyone settles in and then reevaluate. At least a week probably. You may find that after a few days the cats get used to the change and their quality of life is not diminished at all.","score":-2},{"text":"Patricia McConnell wrote this post about introducing cats. Probably could be applied to your situation! http://www.patriciamcconnell.com/theotherendoftheleash/introducing-cats","score":0},{"text":"Our cat wasn't a fan of our dog at all.  We put up a baby gate that the cats can fit under but the dog can't, they then slowly started getting along more. Cats can often take a longgg time to adjust.","score":4}]},{"title":"[Help] Recommendations for a book on raw diet?","url":"http://www.reddit.com/r/dogs/comments/3a1fns/help_recommendations_for_a_book_on_raw_diet/","permalink":"/r/dogs/comments/3a1fns/help_recommendations_for_a_book_on_raw_diet/","score":8,"numComments":3,"subreddit":"dogs","comments":[{"text":"You might want to cross-post this to /r/rawpetfood. They're probably more likely to have the information you're looking for.","score":1},{"text":"I have this one \n\nhttp://www.amazon.com/Raw-Natural-Nutrition-Dogs-Definitive/dp/1556439032\n\nGreat book","score":0}]},{"title":"[Help] I cannot get my dog to sleep through the night","url":"http://www.reddit.com/r/dogs/comments/3a1acm/help_i_cannot_get_my_dog_to_sleep_through_the/","permalink":"/r/dogs/comments/3a1acm/help_i_cannot_get_my_dog_to_sleep_through_the/","score":11,"numComments":14,"subreddit":"dogs","comments":[{"text":"&gt;When she wakes up it might be to go out, where she takes the smallest pee imaginable or to grab a toy which she may or may not play with for 5 minutes.\n\nAbsolutely no toys. Bathroom break and back to bed at most.","score":-1},{"text":"Do you know what breed she is?  How old is she?  How much exercise does she get on a regular basis?","score":0},{"text":"I'm having a similar problem, also with a high-energy puppy (albeit one who is younger-- we think 5 months, maybe 6). One thing we've recently found that has helped a bit is to leave TV on for her. Once it became clear that she wasn't crying because she had to go to the bathroom, we figured it was either boredom or loneliness, and since we noticed that she gets very interested and involved in watching TV, we thought that might make her feel comforted. It seems to have helped at least a little bit; she's still waking us up at the crack of dawn, but not 3x a night like she was.","score":0},{"text":"Chiming in here - other posters are basically right.  Walks can sort of tire a dog out, but for corgis/huskies you need a sold high-intensity play session.  The heat can be hard to manage, but bring a bowl of water with you and get a solid 20-30 minute fetch or kickball session going.  That generally wipes my corgi out for most the day.","score":1},{"text":"How much exercise does the puppy get during the day? Sounds like she's just bored and is waking up because she isn't tired. ","score":-2}]},{"title":"[Discussion] Dog won't stop barking late at night","url":"http://www.reddit.com/r/dogs/comments/3a198b/discussion_dog_wont_stop_barking_late_at_night/","permalink":"/r/dogs/comments/3a198b/discussion_dog_wont_stop_barking_late_at_night/","score":9,"numComments":3,"subreddit":"dogs","comments":[{"text":"is there a reason the dog needs to be crated or tied up at night?","score":0},{"text":"Does he need out at around 5-7am? Have you tried getting up and letting him out when he starts barking? ","score":0},{"text":"My dog did that once.  Me and my ex wife decided to ignore him lest we reinforce the behavior.  Three nights.  \n\nTurns out some dude was scoping out to steal stuff.  My ex's car was broken into the third night.  (Guy didn't even find anything valuable)\n\nSee if there is anything else that might be triggering the dog to bark.  ","score":-4}]},{"title":"[HELP] how do you exercise in this heat?","url":"http://www.reddit.com/r/dogs/comments/3a258z/help_how_do_you_exercise_in_this_heat/","permalink":"/r/dogs/comments/3a258z/help_how_do_you_exercise_in_this_heat/","score":4,"numComments":5,"subreddit":"dogs","comments":[{"text":"We walk early in the morning or later at night. Lots of throwing the ball inside where it's cooler. ","score":0},{"text":"Exercise in the morning (we go around 7am) or in the evening (around 8pm). We also tend to do a lot more indoors games. Yesterday I taught her to stand on paw pods. ","score":0},{"text":"I exercise mine before the sun is up most days. If I can't do that I bring lots of water with us or wait until the sun goes down.","score":0},{"text":"Morning and late evening for walks (mostly evening - 8-ish, we're both slow starters). Also, early evening when I get home from work, we play with the flirt pole and balls in the shaded part of the yard. After he chases the flirt pole for a while, I'll start throwing his squeaky balls into the kiddie pool. That way he has to get in to get them out. \n\nIf it's been really hot that day, I'll wet him down before we go walk.","score":-4},{"text":"We go for our runs in the early morning, and for outings in the evenings we move to higher altitude where it is always cooler.","score":0}]},{"title":"[HELP] Leaving shampoo on for 5-10 minutes, how do you alleviate your dog shivering?","url":"http://www.reddit.com/r/dogs/comments/3a255i/help_leaving_shampoo_on_for_510_minutes_how_do/","permalink":"/r/dogs/comments/3a255i/help_leaving_shampoo_on_for_510_minutes_how_do/","score":4,"numComments":3,"subreddit":"dogs","comments":[{"text":"I just kept lathering and lathering and lathering until the 10 minutes (ok, 7. I never made it to 10.) were up, so I feel like I rubbed a lot of warmth back into him. ","score":4},{"text":"I couldn't stop her from shivering. I would turn the AC off (I live in Oklahoma) and try to reduce air flow but she shivered teh whole time even though I kept lathering. Sometimes I would have a roommate feed her treats but she isn't too interested when I am torturing her.\n\nThankfully she cleared up in the 2 weeks the vet wanted me to bathe her and I didn't have to continue.","score":-2},{"text":"We had pups in the same situation.  We set up a small space heater which blew warm air while they took baths.  They seemed to be much more relaxed after that.  I would not worry too much regardless.  The shivering is a built-in mechanism for the dogs to warm up.","score":1}]},{"title":"[Help] I'm looking for Leonberger Breeder","url":"http://www.reddit.com/r/dogs/comments/3a1b4l/help_im_looking_for_leonberger_breeder/","permalink":"/r/dogs/comments/3a1b4l/help_im_looking_for_leonberger_breeder/","score":8,"numComments":4,"subreddit":"dogs","comments":[{"text":"[Regional Leonberger club](http://neleos.org/) that covers NY.","score":0},{"text":"The site /u/homehealthgirl linked is a good place to start. You can also try the [breeder listings for the Leonberger Club of America](http://www.leonbergerclubofamerica.com/club-info/breeders-studs/).","score":3},{"text":"There are two in my neighborhood. If I run into them I'll ask here they came from.","score":-2}]},{"title":"[Help] me calm down please...","url":"http://www.reddit.com/r/dogs/comments/3a00op/help_me_calm_down_please/","permalink":"/r/dogs/comments/3a00op/help_me_calm_down_please/","score":44,"numComments":19,"subreddit":"dogs","comments":[{"text":"I am so sorry you are going through this.  Only time will tell if all will be well with your pup, but know you did all the right things and he is in the hands of the people best qualified to help him get through the night.  He knows you love him and you are a good dog owner.  Saying a prayer for you and your friend.","score":10},{"text":"I'm sorry this happened to you and your little buddy, I hope he recovers swiftly and fully...sending positive thoughts your way.","score":5},{"text":"Nothing more terrifying that rushing a pup to the vet. Sending positive thoughts and good vibes towards you and the cutie. Keep us updated!","score":5},{"text":"Glad to hear your dog is doing better.  So very scary when emergencies happen.   You did a great job getting him to care, and I'm glad the vet found something that would work.  \n\nSending many good healing thoughts your pups way. ","score":14},{"text":"You saved your dogs life reacting in a timely and appropriate manner! He is adorable. I hope he continues to get better and makes a full recovery. He's lucky to have a wonderful owner.","score":16},{"text":"I'm sorry this is happening to you. Like others said, time will tell. My pup and I have had a rough month ourselves, I thought I was going to lose her last month. Now we're dealing with something a little less severe, but I know how you're feeling. Keep your head up. I can tell you're a great owner and friend to Oreo, and I am sure he appreciates it. Best thoughts and wishes heading your way. ","score":9},{"text":"I am so glad he is doing better!","score":5}]},{"title":"[Help] Trying to find velcro lunch tray dog toy","url":"http://www.reddit.com/r/dogs/comments/3a1qkv/help_trying_to_find_velcro_lunch_tray_dog_toy/","permalink":"/r/dogs/comments/3a1qkv/help_trying_to_find_velcro_lunch_tray_dog_toy/","score":5,"numComments":2,"subreddit":"dogs","comments":[{"text":"I've never seen anything like this. Sounds similar to the [Kyjen toys](http://shop.kyjen.com/puzzle-plush/).","score":2},{"text":"I like to think my Google-fu is strong but I could not find anything like that. No combination of words and exclusions got me close to a food tray. Food with faces was common though. ","score":5}]},{"title":"[Discussion] Does anyone else use a ‘give me space’ vest for their dog?","url":"http://www.reddit.com/r/dogs/comments/3a2a0n/discussion_does_anyone_else_use_a_give_me_space/","permalink":"/r/dogs/comments/3a2a0n/discussion_does_anyone_else_use_a_give_me_space/","score":3,"numComments":2,"subreddit":"dogs","comments":[{"text":"Gorgeous dog! People who respect dogs will read it and stay back, however the vest may attract attention from people that may or may not read it. If there is any, any chance your dog could bite then go with a basket muzzle. The dog can still pant, drink and receive treats but without the risk of some idiot surprising your dog and getting bit.","score":-2},{"text":"I don't but I have noticed them pretty frequently in the Boston area. People tend to assume that a vest like that means it's a service dog and hence won't approach (we actually even have this happen with my dogs pack back). \n\nThey do seem to help and people are pretty good about them. Also was one of those pics from the Fells?","score":9}]},{"title":"**[Help]** I have a five month old pup that was abandoned alone for two weeks, she's totally untrained and afraid of everything. I've been taken by surprise by how sweet she is so I'm keeping her, but where do I start with training?","url":"http://www.reddit.com/r/dogs/comments/39yxfx/help_i_have_a_five_month_old_pup_that_was/","permalink":"/r/dogs/comments/39yxfx/help_i_have_a_five_month_old_pup_that_was/","score":99,"numComments":23,"subreddit":"dogs","comments":[{"text":"If she's afraid, I would absolutely say that you should not raise your voice or otherwise spook her. As much as possible, keep all her interactions with you positive. If she's misbehaving, redirect as much as possible, and set her up for success. Don't force your company onto her, let her come to you of her own choice.\n\nA piece of food or nice toy are great offerings from you to cement in her mind that you're a positive thing. If she's chewing on something she shouldn't, offer her a toy or something you do want her to chew on as a way to redirect instead of doing anything that might create a negative image of you in her mind.\n\nI'm sure she'll come around sooner rather than later, and you can begin training as you would any other puppy. ","score":7},{"text":"Got my dog around 5 months, he's now almost 5years. He was so scared walking out of the shelter he didn't....walk that Is. Just totally froze.  Flipped over and peed all over himself.\n\nIt's slow. It's sad. But it's worth it. Patience patience patience.  If you ever feel frustrated just look into those sad eyes and remember how sad she must feel.  Now he's so much better, still kind of skittish but seriously my soul mate.  So in love with him I would save him over and over again forever ","score":1},{"text":"Passive bonding and positive socialization are very important. High value treats (soft meaty or cheesy treats like hot dog or zuke's or something) are a must.\n\nPassive bonding: She should have a crate/safe spot where she can get away from people and chill with toys and treats. Every once in a while, tether her to you, reward her when she lays down and relaxes, and then let her go back to her safe spot.\n\nPositive socialization: Once you get her to the point that she seems to be coming out of her shell inside your home, start upping the ante in a calm positive way. For the last puppy like this I had, that initially meant placing her on the welcome mat outside my door and rewarding her with high value treats any time she acted anything but terrified. Always do this in a way that you are in control of the situation. Puppies are adorable, so taking her into a public place where people will mob her with loud \"awwwwww\"s would be too overwhelming initially.\n\nDon't pet her unless she indicates that she wants it. Petting is a human thing.\n\nBasically you're trying to let the dog know that you're not going to hurt them and they can trust you when you take them into novel situations. Initially, you're just trying to get the dog to accept human companionship and walking on a leash. Beyond that training is exactly like a normal dog. \n\nSometimes you may trigger their fears accidentally and it's important to remember that you didn't know and you'll be able to reach the same level of trust again with a little patience. For example, I had a puppy mill rescue that freaked out the first time my brother picked up a stick to play fetch with her. He had no idea. She recovered fairly quickly.\n\nSource: My dog is a claustrophobic, skittish crazypants rescue. I'm my shelter's go to foster for timid, terrified, and undersocialized dogs.","score":22},{"text":"Please check out /r/dogtraining!!! There is a ton of good information in the side bar. \n\nEdit: also search for puppy socialization classes in your area, they can be very important to a fearful puppy. They need form positive associations with new people, places, dogs, ect, in order to be a more confident adult dog. It is also essential that you don't do any type of alpha nonsense training with her. You need to be the source of all things great in her life, she shouldn't have a reason to fear you. ","score":7},{"text":"Definitely stay quiet. Let her get to trust you first. Get her a cage and put her in it when you leave, because if she has separation anxiety she will chew up the house. I find putting a blanket over it and leaving some music on helps keep them calm. Treats are also a good way to train, especially potty training.","score":5},{"text":"Be patient.\nTry to start bonding with her. Not only treads, but hand feed her all her food. This helps greatly. If you have a place for her, handfeed her in her place. I have the same at home at the moment, 5 months old, found at the side of the road. Just manage her outside. \nWhen you are Outside, it helps to have a dog clicker like this. Its pretty simple to use: If you see a behaviour you wanna encourage, you click and give a treat. If she is fearful of things outside, Cars, bikes, other dogs etc., just click the moment she sees it. You dog will connect this scary thing with a nice thing and will start to be more confident. \n\nlike others said, find a group with other puppies her age - this ist most important. They need to play, to learn how to communicate propper in the future.\n\nFor training, just start with sit and come. For the next 1-2 weeks, work on those and on your connection to the dog. She should learn, that you are her beacon of safety.\n\nBe nice and gentle, guide her, and dont expect things, just be happy when she works with you. It takes time, but if you train her regular, like 2 times 15 min a day or something like that, you will see results in no time.\n\nI wish you all the best and a lot of fun with your dog. And god dame, post pictures! ;)\n\nhere is a link to a dog clicker\nhttp://www.amazon.com/Karen-i-Click-Training-Clicker-Clickers/dp/B002LAS2KW/ref=sr_1_1?ie=UTF8&amp;qid=1434436956&amp;sr=8-1&amp;keywords=dog+clicker","score":32},{"text":"Just be patient and quiet for about a week before you start any actual training.\n\nShe needs to know you aren't going to eat her before she can learn anything.","score":0},{"text":"I took in a year old pup who sounds the same. I started with leash training, then exposing her to other people and other dogs, then commands like sit, stay, leave it, etc... and finally, anti- bark training so she doesn't bark at other dogs when we walk.\n","score":0},{"text":"Don't coddle her too much. I agree with what's being said here, about keeping a low voice and positive interactions. However, don't over-pamper her because she had a rough start. This sounds callous, and I don't mean it to be, but it sounds like you love her to bits already and it's easy to get overprotective. Once she's had a chance to settle down, you'll need to help her get over her anxieties instead of shielding her from them.\n\nSo, be clear and consistent and patient with her training. It sounds like she might be a quick contender for separation anxiety, so you'll need to ensure that she spreads her love, instead of depending on you for everything. It would be great if your area has puppy socialisation classes and if you can bring her out for walks and to meet people. These would be goals for after she's had a chance to settle in for a few weeks. The more people she meets, and the more interactions she has with children, adults, other animals, the better! Just don't rush her into it.","score":24},{"text":"Lots and lots of little treats, as positive reinforcement or just because.\n\nGood for you for saving her!","score":2},{"text":"Relax. It's a 5 month pup, she will start to love you sooner than you expect and will obey as long as you show her a reward. I trained mine with walks rather than treats. It's hard to understand a dogs previous life and have heard of very sad scenarios where they end up just fine. Keep loving her and she will learn :) ","score":6},{"text":"She is a beautiful dog. I hope you decide to keep her and love her. ","score":8},{"text":"I have a deaf rescue who is afraid of everything, I've had her two years now and she's getting better but when my husband (then boyfriend) first met her she wouldn't look at him or go near him. He warmed up to her by giving her bacon and apple slices. It took her a week to actually look at him in the eye. We slowly noticed she's fine around people who have dogs with them. Have you tried bringing her in  to petsmart (on a leash or in the cart)? It's helped my dog a lot with her nervousness. It actually might help her because she did have siblings and might have relied on them for help and now that they aren't there she's afraid.  ","score":6},{"text":"Pretty girl!\n\nI have a really shy dog myself, he was that way from the time I got him as a young one. They definitely take time and a lot of patience but can overcome a lot of their fears. Be quite, gentle and calm around her. If you get really angry or loud that will probably upset her. She's going to be a very sensitive dog so your corrections need to match her quiet manner. \n\nMy dog used to be so afraid of people that he would just run the other way whenever he saw someone. I saw a really good dog trainer and started taking him to dog training classes. He was quite nervous the first few times but soon settled in. It was a great place to work on actual training skills, but more importantly it was good socialization for him. He eventually got more and more comfortable with the sights and smells of other people and dogs and noises. I made sure the trainer knew how shy he was and she worked at his comfort level. One very helpful and important thing she taught me, is that he needs to learn to not run away from people every time he has a moment of fear. He doesn't need to be super social either, but he does need to learn to accept the presence of others. \n\nSo, what I worked on is this  - I would have him sit at my side when people come over. I tell them explicitly not to look at him, stare at him or pet him. All of these things make him feel very uncomfortable. Tell people to flat out ignore your dog (I warn you that a lot of people will not listen to you the first time you say this, so be firm). My dog used to run away whenever anyone was near him so I have him on a leash and calmly remind him to sit. When he does, I give him lots of treats. I let people know that we're in training and everyone is really good about it. Anyways, start with just having your dog sit at your side and reward and praise when she doesn't run away. Slowly, I would build it up to people sometimes offering their hand for him to sniff. He's now okay with this, but he's never become okay with people petting him when he doesn't know them, so I work with what I am given. \n\nIt's good now though because when people come over, I let them know he's shy and to ignore him. He doesn't run away from people anymore, but rather will come sniff them and check them out when he's ready. Usually by the end of the visit, he's pretty comfy with these new people and allows a lot of them to pet him. \n\nIn general, praise when she's being good and doing well. Liver treats were great for my boy. A lot of love, praise and gentle corrections when she's doing something you don't want her to do. As she settles in I definitely recommend finding a good trainer in your area and enrolling in some classes, it will really help get her used to sounds and sights and you can get constant feedback from the trainer.","score":39}]},{"title":"[Help] 3 month old having trouble understanding the bell to be let out.","url":"http://www.reddit.com/r/dogs/comments/3a22m4/help_3_month_old_having_trouble_understanding_the/","permalink":"/r/dogs/comments/3a22m4/help_3_month_old_having_trouble_understanding_the/","score":3,"numComments":3,"subreddit":"dogs","comments":[{"text":"you have to get HIM to ring the bell before you open the door. right now he just thinks you're ringing the bells as part of your process of opening the door. he's not understanding that you're expecting him to ring the bells to indicate that he needs to go outside.\n\nyou also have to be patient. he's only three months old, he's still very much a baby.","score":0}]},{"title":"[Discussion] What should we bring camping with our dogs?","url":"http://www.reddit.com/r/dogs/comments/3a12di/discussion_what_should_we_bring_camping_with_our/","permalink":"/r/dogs/comments/3a12di/discussion_what_should_we_bring_camping_with_our/","score":6,"numComments":21,"subreddit":"dogs","comments":[{"text":"Seconding the muzzle. You can have the friendliest dog in the world, but if he trips and breaks his leg, he's not going to want you picking him up and carrying him out of there. A basket muzzle is by far the safest option, but a fabric muzzle could probably work to save space. \n\nAlso, I have a backpack for my dog and love it. He carries his own water, etc and it really frees up space in my backpack. Ruffwear makes some really nice packs, if you can find a retailer near you. Depending on the terrain, I also bring boots for my dog to wear, in case the trails get really hot during the day. ","score":9},{"text":"I'd bring a bit of pet-friendly bandaging materials, just in case.\n\nAlso, benadryl.  Know the appropriate dosage for your dog.  Camping can often mean biting insects and it's good if you've got some benadryl for your dog (and for you!)  Make sure you get the plain benadryl that's the tablets.","score":3},{"text":"We have two dogs and frequently camp with a couple that also has two dogs. We like to tightly tie a rope between several trees off to the side and use carabiners to attach six-foot leashes to the rope. It's basically a little dog run for them, so they have room to move and run around without getting loose or out of control.","score":-1},{"text":"A muzzzle and the information to the nearest vet. ","score":0},{"text":"I'm not sure what the temperature will be where you're going, but we just took our dog camping this past weekend and it hit 93 degrees despite being in the mountains. We brought a cooling vest made of wicking material that turned out to be really great! We just saturated it with water before putting it on him and he was able to go hiking with us without getting overheated and uncomfortable. You can periodically pour more water on it as well. We got ours on amazon for about $60 and it even has a little loop on the back for attaching a light if you need it.  ","score":1},{"text":"If for any reason you use a cloth muzzle on your boxer in the heat, just be careful. They're considered breathing challenged and could easily overheat in a poorly fit/tighter muzzle , especially if they're hurt or stressed already. ","score":-2},{"text":"I have one of [these](http://www.amazon.com/Folding-Collapsible-Travel-Water-Army-Green/dp/B006UVSJN8/ref=sr_1_2?ie=UTF8&amp;qid=1434467534&amp;sr=8-2&amp;keywords=collapsible+dog+bowl) foldable dog bowls for my pup.  \n\nEasy to pack.  Light.  I bring it on hikes, picnics, camping trips, etc.  You only need one dog bowl to save space.  Just give food and water separately.  ","score":3},{"text":"A head torch.  If you have a dog leash in each hand it can be difficult to juggle a flashlight too.","score":-1},{"text":"Tick repellant, sunscreen if they have thinner coats plus for their nose and belly, a comb to check for ticks with, a water bottle bowl attachment is nice (you lay bottle on its side and the bowl fills with water when opened and when you pick it up the water flows back into the bottle), harnesses that can support your dogs weight being lifted is always nice for rough terrain, packs are nice to get them to schlep their own stuff (I'll put empty water bottles in my pitbulls if she is going to be doing a lot of swimming as a floaty because she sinks like a brick if she stops moving), also perfect recall training.","score":12},{"text":"This is more for something to bring *in* your dog... \n\nI can't remember what it's called, but the vet can give your dog a medication that guards against them getting sick when they drink water from streams and puddles. ","score":-2}]},{"title":"[Discussion] I never realized how jittery people are around bigger dogs.","url":"http://www.reddit.com/r/dogs/comments/39zjkj/discussion_i_never_realized_how_jittery_people/","permalink":"/r/dogs/comments/39zjkj/discussion_i_never_realized_how_jittery_people/","score":38,"numComments":64,"subreddit":"dogs","comments":[{"text":"55lbs isn't even big but i doubt its the size of your dog. its how the dog looks. \n\nwalk a 80lb golden and no one avoids it. walk a 50 lb pit and people cross the street. i've had a lady see me coming and immediately drop her gardening tools and hastily went inside. i've had people pick up their kids and go inside. i've had a 10lb dog bust through its front door and charge across the street at my dog whlie barking its head off. the lady was chasing her dog and when she got to me she was BAWLING b/c she thought her dog was for sure going to be eaten in one bite. it happens. all you can do is chuckle and move on with your day. \n\ni will say though that i do not care how many times you yell out your big ass 100 lb dog is friendly, if you say heel and that thing is still pulling towards me, i'm crossing the street. i'm more comfortable with a \"vicious\" pitbull who is walking nicely next to the owner and listening to voice commands over a \"friendly\" lab pulling its owner everywhere. ","score":0},{"text":"I was just thinking about that, how weird!\n\nToday I was out walking my hellhound, and she insisted on bringing her tennis ball with her. We passed by a family with a toddler (maybe 18mos-2years), and he pointed at Nora and started walking up to her. His mom quickly corrected him, but Nora was curious and dropped her ball. He quickly picked it up, and me and the mom freaked, me because I know my dog plays rough, and the mom because she didn't know if Nora was aggressive or not. Sure enough, the kid didn't drop it right away, he pulled it closer to him, and Nora jumped forward to try and snatch it from him. He got scared and dropped it then, and ran crying to his mom. She wasn't upset at me, but it bothered me. There's not really anyone to blame,  the kid's only a baby still, and Nora wasn't aggressive or anything, it's just a bad combination.\n\nI used to be really bitter that people were scared of my dog but loved the small bitey dogs that live in my complex. It took me awhile, but I kind of started to empathize with them, especially the kids. Fear of dogs is pretty common, and it's a lot easier to get your face torn off by a rottweiler than a shih tzu. I'm not saying it's totally fine and great, and no one should be ostracized for their dog's size or presence, but I do understand where people are coming from.","score":-15},{"text":"Yea, it depends on the breed too.  Labs and retrievers people usually want to pet.  Other large dogs, especially rotties, pits and the like people go out of their way to avoid you.  And then the giant breeds people mostly look at you like \"omg what is that??\"","score":4},{"text":"As a human and dog lover, I give dogs and their owners a berth or ask to pet always. These dogs frequently look friendly and are acting like dogs who are happy to be smelling smells, but I'm not about to walk into them. Some of these people (the ones who are simply giving you space) might just be loving your dog in their minds. ","score":9},{"text":"People often look visibly nervous when my greyhound wags and pulls towards them (she *freakin loves* people). I know a lot of people aren't \"dog people\", but I suspect being big, black, and uh... pointy? doesn't make her look particularly friendly to the uninitiated.","score":0},{"text":"People are just really nervous in general these days, I think.  Crime is way down but people panic if a stranger walks past their house, children are safer but so many parents won't ler them out of sight, etc.\n\nMaybe if you dress your dog in a pink tutu people will be less afraid, hehe.","score":-10},{"text":"I have a large dog (around 120lbs) and have had people move very quickly to get out of his way. Funny thing is, he's great with people especially little kids, but I've had many parents tell their kids they can't get near him. The worst he'll do is lean against someone (which I consider his version of a dog hug).","score":2},{"text":"Consider yourself lucky...my 62lb hound is yellow with floppy ears so people assume he's a lab and no one ever respects his space, especially people with kids.\n\nLuckily I have no problem telling off the parents who let their pack of children on rollerblades come flying down the sidewalk towards my poor animal. ;)","score":-6},{"text":"[Here is my dog with my parents' dog](http://i.imgur.com/uEDcDjE.jpg). My dog Leo weighs 25 pounds. The big guy there weighs 120 pounds.\n\nAbout half the people we meet go out of their way to avoid him. The other half go out of their way to *touch him*, which is unfortunate because he's very skittish with strangers. Soooo many people say \"Can I pet your dog?\" while actually petting him and just keep on petting when whoever's walking him says no.\n\nI'd actually be happier if people avoided him while we're trying to work on desensitizing him. It's really hard to manage him when people randomly grab at him as they pass us.","score":-2},{"text":"As has been posted before, it is more of a breed thing in my opinion. I have a [larger dog](http://i.imgur.com/NOz16rW.jpg) as well, around 100 lbs, but everyone falls in love with him when they see him and want to pet him. ","score":4},{"text":"If it makes you feel better, where I live plenty of people are scared of my dogs too. I've had people cross the street to avoid my totally ferocious 8lb toothless papillon. ","score":-3},{"text":"I WISH people were more afraid of my dog. He's a chow and while he's pretty small for a big dog he is very mean and very strong and can easily cause somebody serious injury if they approached him the wrong way and freaked him out. But he's so fluffy and has a cute dumb face and people will just run up to him and start grabbing. I've had to scream at a few kids before because they'll just get their tiny hands in his face without asking. We haven't had any incidents thank god, but I'm always afraid.","score":-3},{"text":"I love big dogs, even though I couldn't own one myself, but I always ask if the dog is nice and if I can pet them. I think the problem with a lot of people is due to news reports with dog bites is usually larger dogs. Even though mini-pincers are some of the most vicious, but loyal, dogs I've seen bite people but never on the news. Combine that with the pit bull reports and the fact that the average person really doesn't know what a pit looks like and you get a lot of nervous people. ","score":6},{"text":"I'm laughing at perceived response to a 55 lb dog! My small dog is 55 lb and everyone wants to pet him since he's cute. Looks like a golden but colored like a german shepherd. No one has ever crosse a street to avoid him. My larger dogs are two german shepherds, 85 &amp; 94 lbs, plus my shiloh shep who is 108 now. \nI do get frequent comments with any one of them, but people sometimes do avoid them. usually if they have a dog that is reactive and don't want to get into a situation. I often take the three bigger ones hiking off leash in an accepted off leash are and people that don't know us are intimidated by them until I introduce them. \nOf the four, the 55 lb mix with golden retriever face and floppy ears, who is almost 13 is most likely to snap with little warning at other dogs.  He is one who bit my neighbor once, most likely to kill a stray cat. People always want to pet him and he is very good normally. It's just funny how my other guys are so much more social overall but people not familiar with shepherds are so nervous","score":4},{"text":"I think people are more afraid of dogs, or maybe it's just our area. We have people cross the street to avoid our 13 pound jack russell to the point where we're shocked if somebody actually acknowledges her. ","score":-5},{"text":"Reactions to our boxer/pitbull mutt are pretty mixed. She's 30 pounds, but small for her weight because she's so densely muscled, so some people approach thinking she's a puppy. Some start to approach, but get up close and she her pitbull muscles and shirk away. We live near a research university, so there are a lot of Chinese international students near us, and most of them are terrified of her. Some will get close and not notice her until they're very near and will almost scream run in a different direction when they see her (dogs in Chinese cities are usually 15 pounds or less and fluffy).\n\nOn the other hand, I always avoid the little yappy ones like the plague when I'm out and about. I was terrorized by an evil chihuahua when I was a kid, so I have a deepy engrained mistrust of small dogs.","score":-9},{"text":"We have a 30+kg mutt. Obvious staffie-like head, what the rest is is anyone's guess.\n\nI've often encountered people who are twitchy around him, which is fine. Not everyone has to love dogs.\n\nOne thing that does change everything is his backpack. Once that is on and we are off hiking, people focus more on that than the dog. Even young kids left wailing by a Jack Russell pup are caught between \"OMG! A **BIG** DO...why is it wearing a backpack?\"\n\nWhether or not it's because a dog carrying his own kit is an unusual sight, or they assume he is a highly trained (I wish) working dog of some kind, I dunno. But deffo see more smiles/laughs with the backpack on.","score":9},{"text":"I have an American Bulldog/Cattle Dog Mix who's 65lbs and a goof ball.  I stopped at a rest stop the other day on our way back from vacation and this religious dude handing out pamphlets goes \"can I interest you in a pamphlet but I don't want your pitbull to bite me\" as soon as I get back in the car I start laughing because my dog would never hurt anyone... Unless you're looking for face licks. \n\nOn another note my sister has a weiner dog and she's evil but when we took my \"pitbull\" for a walk Noone wanted to pet him but wanted to pet my sister's weiner dog. I don't understand the logic but oh well more of my dogs cuddles and face licks for me! ","score":-4},{"text":"My hound mix is about 85 lbs with big white gleaming teeth, which are always on display because he looks like he's grinning. He has displayed zero aggression, but lots of people cross the street when they see him coming. If they don't, he will veer toward them to check if they want to pet him or not. If they ignore him, he sulks a little but continues on. If they do acknowledge or give any indication of wanting to pet him, his whole body wags, dispelling most people's fear.\n\nI always stop kids who are running straight up to him, but only to tell then that they should always ask if they can pet a dog, then I tell them sure, cause he loooooooooves kids and old people.He's so gentle with them.","score":1},{"text":"Depends on the person. I absolutely love big dogs and will go out of my way to ask if I can pet them. I remember when I first saw a Leonberger. They're so handsome.\n\nI think that the people who are afraid of dogs are probably okay with toy breeds,  but afraid of larger dogs","score":0},{"text":"Some of the friends I hang out with have a long hair Chihuahua, about 10 lbs.  People always want to pet the cute little dog.\n\nMy friend always tells them to pet my dog, the 70lb pit mix, because my dog is friendly with strangers and their's isn't.\n\nPerception is an interesting thing.  ","score":7},{"text":"People definitely stereotype dogs just as they do other people. Sometimes it's because they have had bad experiences with a breed in the past, or just because subconsciously they are or aren't comfortable. \n\nI've got a fearful dog so I definitely appreciate giving us space. The people I've got to watch out for are the 'dog people', who insist all dogs like them as they walk up and reach at my dog with a high pitched voice, even though he's made it clear he doesn't want to interact with them.","score":2},{"text":"Its all about the breed.  Everyone loves my sister's GSD puppy but are very skittish around her \"big sister\" - my 60lb Malinois.\n\nMy favorite ever instance of someone being afraid was a guy who came up to me in Petsmart and asked if he could pet the Mal.  He said he was trying to get over his fear of them because he's been chased by police Mals so many times... \n\nGetting bit by an unfriendly small dog will hurt, getting bit by an unfriendly 50+ lb dog could be life threatening.","score":-5},{"text":"I wonder how much of it is ears. Floppy eared dogs seem to get a lot more love than dogs with upright ears. Your dog has upright ears and a short coat, but change those traits and I bet people would be all over them. \n\nHumans are weird. ","score":1},{"text":"I said the same thing after I got my pup (she's some sort of pit). She's 65lbs now and about knee height and I notice that people act 1 of three ways. 1) they're terrified and do whatever they can to get away. 2). They adore her , And 3) they make a comment about her having a big head and then they usually try to leave. \n\nI'm still getting used to how different I'm treated with her than how I am alone. People are usually  (like you said) jittery and hostile. It's a shame.","score":-4},{"text":"It's funny because the smaller dogs are much more likely to be aggressive than most big dogs...","score":3}]},{"title":"[Breeds] Help me pick a second dog for my family","url":"http://www.reddit.com/r/dogs/comments/3a1nfz/breeds_help_me_pick_a_second_dog_for_my_family/","permalink":"/r/dogs/comments/3a1nfz/breeds_help_me_pick_a_second_dog_for_my_family/","score":3,"numComments":6,"subreddit":"dogs","comments":[{"text":"Your post SCREAMS companion breed to me.  The only possible thing is the size of the dog as you have young kids, and small dogs can get hurt, but I don't think that would be a massive issue.\n\nFrench bulldogs I think would be an ok fit.  The key is talking to the breeder to ask how much exercise their dogs tend to get daily and what amount is too much.  If they're a good breeder, they should know their lines and be able to give you a good answer.\n\nGiant breeds can fit in with the exercise that you've listed, but honestly, if you're going the puppy route, big puppies can be an absolute nightmare.  Great Danes, for instance, are famously incredibly active for the first few years of their life and then peter down.\n\nSome other breeds that come to mind:\n\n* [Cavalier king charles spaniel.  Adorable, sweet, up for some fetch or other play.  Note that there are systemic health problems in the breed, so you'd need to carefully screen your breeder and see what they have planned to mitigate those risks.\n* Havanese.  They're a little sturdier than many of the companion breeds, but are absolutely adorable.  Note that they do have a coat that needs trimming.\n* Yorkie.  They're small and once again need coat trims, but they're really fun dogs.  Up for whatever you're up for, and are happy to play.  They are terriers technically, so they may have more prey drive than some of the other dogs, but the yorkies I know don't have issues with cats or anything.\n* Bischon - super cute and cuddly, need trims\n* Coton de tulear","score":27},{"text":"Frenchies really aren't that fragile. They're bulldogs after all. You're correct in thinking that they can have health issues related to their flat-faces. They should be able to handle low-intensity walks (although talking to your breeder is a great idea). Heat is an issue for them. They can be stubborn to train. I would say for you, they're doable. Bonus: Little dog size, big dog farts. If you want a bigger dog, check out the Olde English Bulldogge. Bulldog temperament, but less health problems. They're strong though. Even the Frenchies can surprise you with how strong they are.\n\nThough, it sounds like a lot of different breeds could be a good match for your family.","score":10},{"text":"Off the top of my head I can't contribute a lot, it's quite late here; But I'd not bother with the French Bulldog. Bit too small and fragile for children. Plus health issues.\n\nIf you didn't already have one, I'd suggest a Schnauzer. Perhaps a Cocker Spaniel? Or with suitable training, a Standard Poodle.\n\nThe only issue with any dog over about 15kg is that an excitable 1yr old pup can knock over children easily, even if they don't intend to. I'd stick away from Wolfhounds/giant breeds simply because of that. ","score":0}]},{"title":"[Help]Adult dog randomly peed on my bed","url":"http://www.reddit.com/r/dogs/comments/3a1v31/helpadult_dog_randomly_peed_on_my_bed/","permalink":"/r/dogs/comments/3a1v31/helpadult_dog_randomly_peed_on_my_bed/","score":2,"numComments":4,"subreddit":"dogs","comments":[{"text":"I would take her to the vet. It could be a UTI or it could be some type of incontinence. If she's spayed, the likelihood of incontinence goes up. \n\nWatch her next time she pees. If she pees a little bit here, a little bit there, and goes in a lot of different spots but doesn't pee in a large amount, then a UTI is likely. ","score":0}]},{"title":"[Discussion] Why does my dog suddenly walk under chairs all the time?","url":"http://www.reddit.com/r/dogs/comments/3a1tdj/discussion_why_does_my_dog_suddenly_walk_under/","permalink":"/r/dogs/comments/3a1tdj/discussion_why_does_my_dog_suddenly_walk_under/","score":2,"numComments":2,"subreddit":"dogs","comments":[{"text":"Maybe something interesting scurried under there one day, she followed it, it was fun so she continues to do it? \n\nSometimes dogs discover new things they like and stick to them for a while (or forever). \n\nMy dog recently discovered that cats like to hide underneath parked cars so now her new favorite thing to do is check under every car we pass by. \n\nShe also discovered how fun it is to run full speed through the living room, jump over the back of the couch, through the open french doors and onto the deck. She now does this at every opportunity.\n\nI guess if she starts to be obsessive or neurotic about, it might be something to be concerned about. Maybe look out for other signs of changes in behaviors just in case.","score":15},{"text":"My dog loves running under our end tables. He will detour to run under the table. He just thinks it's fun.","score":4}]}]}]
