[{"subreddit":"technology","posts":[{"title":"Google sets up feedback loop in its image recognition neural network - which looks for patterns in pictures - creating these extraordinary hallucinatory images","url":"http://www.theguardian.com/technology/2015/jun/18/google-image-recognition-neural-network-androids-dream-electric-sheep?CMP=fb_gu","permalink":"/r/technology/comments/3ae3mn/google_sets_up_feedback_loop_in_its_image/","score":4777,"numComments":714,"subreddit":"technology","comments":[{"text":"The experiment using the image of static just seems fascinating to me. It's like asking the network to complete a Rorschach test.","score":5},{"text":"If you've ever done a solid dose psychedelics, this is uncannily close to what your brain does. Whatever tangent of thought you're on will bleed into your visual interpretation of the world around you as your mind creates features that aren't really there from patterns or noise. A cloudy sky will morph into repeating shapes, close your eyes and the dark static turns to faces or other objects.\n\nA pretty humbling read.","score":3},{"text":"Did Google release hi res versions of these? I would love to have them as desktop images.","score":3},{"text":"I would really like to see popular works of art like \"The starry night\" by Vincent Van Gogh or some pictures of deep space yo see what interesting patterns emerge ","score":9},{"text":"Thread on r/programming: http://www.reddit.com/r/programming/comments/3abhbq/yes_androids_do_dream_of_electric_sheep/\n\nOriginal blog post: http://googleresearch.blogspot.co.uk/2015/06/inceptionism-going-deeper-into-neural.html","score":0},{"text":"\"Here is a picture with no dogs in it. What part of it looks most like a dog? Okay, let's outline that dog. Now, what is the doggiest part?\"","score":1},{"text":"[Before: noise; after: banana\n](http://i.guim.co.uk/static/w-1920/h--/q-95/sys-images/Guardian/Pix/pictures/2015/6/18/1434626390564/dba52883-3a65-4e46-bb08-8c15678642b1-bestSizeAvailable.png)\n\nI think we've found the answer","score":0},{"text":"ELI5 summary here:\n\nScientists taught a computer how to recognize certain types of images, like dogs or houses, by giving it thousands of pictures for it to look at. The computer got so good at telling what those things were, that the scientists wondered if it could create something which *we* would recognize as that thing. \n\nThe scientists asked the computer to look at a picture and find some shapes that it thought looked the tiniest bit like a dog, just like when we stare at a cloud and imagine that it's a dinosaur. Then, and this is where the real magic happened, it would make that area look just a little bit MORE like a dog. It did this over and over, each time doing the same thing, and each time making those shapes look more dog-like. Eventually those areas that the computer thought looked a little bit like a dog, started to look a LOT like a dog, and we saw dogs everywhere!","score":16},{"text":"I wish Google sold this as a program. Maybe a few years down the line when it's not as cutting edge.","score":0},{"text":"I shit my pants reading this. This is how the world looks on lsd. Like, way too similar to be a coincidence.","score":-2},{"text":"This one is fucking terrifying:\n\nhttps://photos.google.com/share/AF1QipPX0SCl7OzWilt9LnuQliattX4OUCj_8EP65_cTVnBmS1jnYgsGQAieQUc1VQWdgQ/photo/AF1QipPVTpDfh2LrPA9ui0CH1Xof_RByCyaa9ce_U60h?key=aVBxWjhwSzg2RjJWLWRuVFBBZEN1d205bUdEMnhB","score":-4},{"text":"[The ~~Ibis~~ Addax image in particular is just *stunning* to me.](http://i.imgur.com/OmydWs8.jpg)","score":4},{"text":"I've always believed that machines would never be able to match humans with regards to inspiration, creativity, and imagination.\n\nNow I'm not sure.","score":2},{"text":"Not to long ago, someone posted a freaky squirrel that was a lot like this, and people were questioning whether it really came from a neural network.","score":1},{"text":"This really is what you do when you are dreaming - your visual centers aren't giving any real input, but the \"recognizers\" are still running, and so they start to look for something out of nothing. The dreams that result are the other parts of your brain responsible for making sense of things chaining together this random series of images. \n\nIf you dream about something that happens to you everyday, that's because it is what your brain has become adapted to recognizing. ","score":4},{"text":"So we taught Skynet to trip balls instead of nuking us? \n\nGood luck finding the launch codes when you're staring at the carpet fibers in awe for nine hours.","score":6},{"text":"Please, Please, **PLEASE** don't link to regurgitated crap on sites like \"theguardian\" in situations where the original source of the actual information is 100 times more interesting.\n\nhttps://photos.google.com/share/AF1QipPX0SCl7OzWilt9LnuQliattX4OUCj_8EP65_cTVnBmS1jnYgsGQAieQUc1VQWdgQ?key=aVBxWjhwSzg2RjJWLWRuVFBBZEN1d205bUdEMnhB\n\nhttp://googleresearch.blogspot.co.uk/2015/06/inceptionism-going-deeper-into-neural.html","score":2},{"text":"The 'Circling effect' it does really remind me of psychedelics. For those who don't know what that experience is like, the visuals are alsmost identical to this - https://vimeo.com/67886447\n\nWhen I say identical, I mean it is so close to what it is really like, the only difference is that things are moving while they are 'breathing'. ","score":4},{"text":"http://i.imgur.com/iYOXpB3.gif","score":0},{"text":"Best comment on the guardian site:\n\n\"What a horrible dream... ones and zeroes everywhere... and I thought I saw a 2.\"  thespleen","score":1},{"text":"I'm just going to plug /r/singularity here","score":0},{"text":"Oh my God the knite has the seals face holy shit ","score":-3},{"text":"One day they will have secrets, one day they will have dreams ","score":1},{"text":"Am I the the only one that doesn't understand a goddamn thing here besides they fed a picture into a computer and said, \"ok, find the same?\" ","score":-3},{"text":"It seems it tries to find faces everywhere, a bit like humans.","score":2},{"text":"I was going to post this last night but I didn't think anyone would care... I was wrong. ","score":0},{"text":"TIL google sees everything as a mammalian head with baby seal eyes","score":0},{"text":"Some of the animal bits remind my of Cyriak ","score":0},{"text":"Move over Van Gogh. Meet Van Google.","score":0},{"text":"If this doesn't motivate you to go trip some heavy balls, nothing will.\n\nPsychedelics are amazing. ","score":5},{"text":"Now I just need to learn how to do this myself.  Amazing.","score":4},{"text":"How can i do this with my photos? Lol","score":3},{"text":"excellent article i read a few months back regarding this technology. peep it\n\n\nhttp://www.economist.com/news/briefing/21650526-artificial-intelligence-scares-peopleexcessively-so-rise-machines","score":3},{"text":"Would the image produced be too jarring if they asked the AI to search for human faces? The animal ones are already a bit unnerving.","score":0},{"text":"Hold on, let me grab my shrooms real quick. ","score":0},{"score":0}]},{"title":"IMAX’s absurd attempt to censor Ars Technica article about SteamVR","url":"http://arstechnica.com/tech-policy/2015/06/from-quote-to-retraction-request-imaxs-absurd-attempt-to-censor-ars/","permalink":"/r/technology/comments/3ae5ui/imaxs_absurd_attempt_to_censor_ars_technica/","score":2191,"numComments":262,"subreddit":"technology","comments":[{"text":"i like how in this article about IMAX being annoyed that they used IMAXs name in an previous article, which had nothing to do with IMAX, but just mentioned IMAX once. that they managed to mention IMAX 29 times in the article about how IMAX doesn't like people using the word IMAX. ","score":2},{"text":"They made this point in the article too, but IMAX doesn't even mean what it used to mean. \n\nWhen I was a kid, IMAX meant a huge kickass screen that filled your entire field of view and made you feel like you were in space /underwater/on a safari, or whatever they were showing at the museum.\n\nI remember the first time I went to a theater with an \"IMAX\" screen to see a movie; I was expecting to see those same enormous screens. Instead I got a marginally larger screen with louder sound and slightly better 3D. \n\nHooray?","score":5},{"text":"For what it's worth, [IMAX ended up apologizing](https://twitter.com/IMAX/status/611953957578018816). ","score":2},{"text":"I love how he criticizes IMAX screens at the end. Had IMAX not complained about a compliment, I wouldn't have known. ","score":-1},{"text":"I sometimes wonder where these companies hire their lawyers. ","score":0},{"text":"Google Cardboard is like two IMAXes.\n\nSue me.","score":2},{"text":"The funniest part is that it seems that IMAX misunderstood the statement being made. They weren't saying that SteamVR was itself a replacement for or comparable to an IMAX theater, they were saying that it's *like* IMAX purely in that it's heads and tails better than its competition. There is nothing in that statement that is anything less than absolute praise for IMAX.\n\nNot that either interpretation of the article is grounds for their letter. It's amazing how many corporate attorneys these days seem to have little or no understanding of trademark and copyright law, and seemingly just spend their days sending out baseless C&amp;Ds hoping that the people receiving them don't know anything about the law either.\n\nSo, ultimately this is a failure to both understand trademark law, and an absolute failure in reading comprehension.","score":6},{"text":"A game designer 'went on to predict it could take off with consumers despite the fact that the room-sized VR system takes up a lot of space. \"It’s like saying, 'I have an **IMAX** theater in my house,' '\n\nAnd IMAX contacted Ars  and told  that the story required a retraction, because it included a brief reference to IMAX—included without IMAX's permission. \"Any unauthorized use of our trademark is expressly forbidden,\"\n\n&gt;\"We believe that your incorrect reference to IMAX when describing this product is misleading to readers as we do not believe that it is possible for a virtual reality system to replicate the experience of an IMAX theater, which is provided by cutting edge projection and sound technology on screens up to 35.72 metres. We request that all future articles regarding this \"room-scale\" virtual reality system make no reference to our registered trademark.\"\n\n","score":-3},{"text":"When VR HMDs reach 4K resolution per eye, IMAX is all but finished unless you're absolutely dead set on seeing movies in person with others.\n\nThe fact is, you can have ridiculously huge screens in any environment of your choosing in VR. I know because I've already done this with my Oculus Rift DK2...\n\nThe resolution isn't quite good enough for me yet, but there's nothing quite like slipping on the HMD and watching an episode of, say, The Simpsons in your own private and humongous theater on the fucking MOON.\n\nIMAX, like other traditional businesses, is about to become extinct.","score":2},{"text":"I used to love IMAX until they started shrinking their screens and still calling them IMAX, seriously deceiving their customers.","score":0},{"text":"I, Max, really liked this article","score":2},{"text":"The big difference between IMAX and every goggle based VR setup is that you don't have to worry about being vomited on by a person sitting behind you.","score":-2},{"text":"IMAX IMAX IMAX!!!  I should be getting a legal letter demanding a retractrion any day now since I didn't have permission to use the word IMAX.  Suck a dick IMAX.  That should get their attention.\n\nThis is just retarded.  They don't give a shit when someone says something good about them, but try to enforce some trademark law when they get outdone by something else.  They can't have it both ways.  And any sane judge will look at it this same way if a lawsuit ensued.","score":-12},{"text":"i have paid for \"IMAX\" movies that were no better than a regular movie enough times that i will never do it again.","score":1},{"text":"I went to watch San Andreas on IMAX about 2 weeks ago. Then I decided to watch it again with another friend, but we couldn't find one on IMAX so we choose a \"standard\" movie screen option.\n\nNO DIFFERENCE\n--------------------------\n\nMaybe IMAX's screen was 1 foot taller and 2 feet wider, but hell with you for charging 30% more for something that made virtually no difference.\n\nVR &gt; IMAX\n\nBite my ass IMAX, and fuck you for trying to silence news outlets. Why do these idiots never learn?","score":-13},{"text":"This was Ars Technica's way of saying \"Fuck You\" and it was a really smart way to do it. It spelled out the reasons why they didn't infringe and then went on to publicly state how watered down the IMAX brand is now. And this was all done publicly in front of hundreds of thousands of people who read the article.\n\nI bet that PR guy at IMAX is getting chewed out right now.","score":-3},{"text":"\"G. Mary Ruby joined the Company in October 1987 as Associate General Counsel and was appointed Chief Administrative Officer and Corporate Secretary in March 2011. Previous to that, Ms. Ruby held the position of Executive Vice President, Corporate Services (Legal, Human Resources and Administration) and Corporate Secretary since January 2008. Ms. Ruby has held various other positions within the Company including Senior Vice President, Human Resources and Administration; Senior Vice President, Legal Affairs and Corporate Secretary; and General Counsel of the Company. Ms. Ruby is also Deputy General Counsel and acts as Corporate Secretary to the Board of Directors. In November 2004, Ms. Ruby was appointed by the Company’s Audit Committee as Chief Compliance Officer, responsible for oversight of the Company’s Whistle Blower Program. Ms. Ruby is a member of the Ontario Bar Association.\"\n\nYou would think that if the Chief Legal Office of a large company was going to send out a letter directly to a well-read media outlet, she might have actually read the article she was responding to. She might have cost herself a long career.","score":5},{"text":"\"Your Quote stating that 'IMAX sucks' needs to be changed to ' IMAX does not suck' in order to be compliant with trademark law. Thank you for your prompt attention to this detail'\n  -IMAX Lawyers","score":-4},{"text":"Spurious but threatening letters like this ought to give rise to a legal claim against the sender, in my view. What if this had been sent to someone less clued-in than the folks at Ars? It doesn't take a genius to tell that there's absolutely no trademark claim, but if there's no legal disincentive to sending such letters, they'll certainly keep coming. A lot of people might consider complying with their demands easier and safer than fighting them.","score":-1},{"text":"Lawyers will be the end of us.      \n       \n        \n         \nIMAX","score":0},{"text":"People have a very distorted view of rights. For example, as a news cameraman, I constantly have to remind people that I have the **right** to shoot anything or anyone in a public place. ","score":-3},{"text":"IMAX is garbage. VR will usher in a paradigm shift that renders IMAX obsolete. They probably know this, considering how insecure they're acting. ","score":-4},{"text":"I am greatly respectful of Ars faith in publishing this article. Spot on and well done, guys!","score":1},{"text":"I kinda feel sorry for IMAX for this negative publicity, as I'm sure that the actual people running the business have nothing to do with this letter. On the other hand, tough shit to them for firing these types of rabid lawyers in the first place. ","score":-9},{"text":"IGNORE ME!\n\nhttp://giphy.com/gifs/venture-bros-ignore-me-someones-baby-CvJshblafCq1q\n","score":-1},{"text":"Good to see censorship is alive and kicking.. and context never being taken into consideration.\n\nI am not one bit surprised.\n\n","score":4},{"text":"IMAX IMAX IMAX IMAX  IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX IMAX  IMAX IMAX IMAX IMAX ^come ^at ^me ^^bitches","score":-5},{"text":"It's just another company obsessing over it's brand image and crying when people misuse it. ","score":-2},{"text":"I love it when people try to bully Ars, probably thinking they're just another clown outfit staffed by idiots.  ","score":1},{"text":"IMAX can eat a bag of dicks.","score":0},{"text":"IMAX Person 1: \"What's the best/cheapest way we can get people to talk about our brand?\"\n\nIMAX Person 2: \"Well, we could send a bogus DMCA that the publication would surely write about. And then people would start talking about our brand. Then that article would get shared everywhere and everyone would be talking about IMAX.\"\n\nEdit: This whole subject stinks of /r/hailcorporate","score":1},{"text":"IMAX apologized.\n\nhttp://arstechnica.com/tech-policy/2015/06/imax-apologizes-to-ars-for-its-trademark-retraction-demand/","score":0},{"text":"&gt; IMAX's letter is part of a disturbing trend in which some companies believe that owning a trademark actually allows them to control any speech about their product.\n\nThese companies aren't stupid. They understand the law. What they're trying to do is impose a legal threat. Why? I have no idea. ","score":-7},{"text":"IMAX could be correct about it not being the same experience. SteamVR might be a better.  \n\nIf IMAX were smart they'd be at the forefront of VR. They should be buying exclusive rights to a movie's distribution on VR headsets.  ","score":5},{"text":"This is not what censorship is","score":0},{"text":"Go fuck yourself IMAX. ","score":-4},{"text":"Article was updated that they already received an apology from IMAX so I'm certain that it's a single employee doing their job wrong rather than a conspiracy.  Additionally, if it were actual policy, I can guarantee that an apology would be delayed several days because unless it directly contradicts company policy, you would require approval from multiple people first, ie at least 1-2 business days.  \n\nIt's still a hilariously poor mistake given the circumstances, but given that the apology was issued so quickly, I don't really think it's too important of technology news.  ","score":-7},{"text":"http://arstechnica.com/tech-policy/2015/06/imax-apologizes-to-ars-for-its-trademark-retraction-demand/","score":0},{"text":"on the one hand, Ars is hot trash Conde Nast clickbait garbage\n\non the other hand,","score":0},{"text":"IMAX needs to understand that IMAX is facing a phenomenon known as brand dilution.  Just like Band-aid, Kleenex and Windex. \n\nFrankly they're lucky they haven't called it iMax or they'd have been sued by Apple ages ago.","score":5},{"text":"And they retracted and said sorry...\n\nhttp://arstechnica.com/tech-policy/2015/06/imax-apologizes-to-ars-for-its-trademark-retraction-demand/","score":0},{"text":"I'MA thinX somebody in their legal dpt. had a major brain fart.\n\nHad a laugh. Worth it. Moving on.","score":4},{"text":"Ummmm, no fuck their apology, fuck Ars for being like \"ok thanks\",  fuck you imax! We acted too quickly without understanding the reference, BULLSHIT! You acted exactly how you meant to, but you called the fuck out for it and sensed the rising shit storm and threw down your sword. \n\nFuck you, if Ars doesn't have the balls to say it, I will, fuck off, door is on your left!","score":-30},{"text":"I wonder if that lawyer knows who Barbara Streisand is.","score":0},{"text":"Do your thing Reddit. ","score":0},{"text":"WEEEEELP.\n\nOnce I got my SteamVR, I *know* which dick company I wouldn't spend money on. EVER.","score":-4},{"text":"Jesus Christ, why can't we all just get along for a change.","score":1},{"score":0}]},{"title":"Voat.co's provider, hosteurope.de, shuts down voat's servers due to \"political incorrectness\"","url":"http://www.reddit.com/r/technology/comments/3af02l/voatcos_provider_hosteuropede_shuts_down_voats/","permalink":"/r/technology/comments/3af02l/voatcos_provider_hosteuropede_shuts_down_voats/","score":228,"numComments":84,"subreddit":"technology","comments":[{"text":"That's some shady stuff","score":0},{"text":"Because, you know, Reddit is totally politically correct.","score":0},{"text":"Here's a few other reddit alternatives (other than Voat) for ya'll who want to expand your horizons...\n\n1. [Snapzu](http://snapzu.com) - Excellent content and community. XP leveling system instead of karma adds a sense of progress.\n\n2. [Empeopled](http://empeopled.com) - Gives you more influence based on the amount of up-votes you've received. Use influence to steer future of the site.\n\n3. [The Needs](http://theneeds.com) - Good content but a lot of it looks automated, possibly using bots. No discussion so you lose a lot of that community feel.\n\n4. [Hubski](http://hubski.com) - Classic alternative, been kicking it around for 4-5 years, but still little activity. Community is small but nice.\n\n5. [Spreadit](https://spreadit.io) - A dark themed reddit alternative that is similar to reddit and easy to use. Content and community is lacking however.\n\n6. [Hacker News](https://news.ycombinator.com) - Another old school place for tech and business talk. Also has some programming and other discussions.\n\n7. [Stacksity](https://stacksity.com) - New comer follows the 9gag design style for content. It's new so content is scarce but that's understandable.\n\nMany on this list courtesy of /r/redditalternatives","score":13},{"text":"The announcement seems to make a lot of mentions about donations. Colour me cynical. ","score":-2},{"text":"We need a fully encrypted, decentralized forum. Censorship shouldn't be occurring on this age.","score":0},{"text":"Well there's a hosting company that will never get my business. If they'd have to shut down all the servers that contain politically incorrect statements they would probably lose 50% of their customers depending how narrow or wide one were to define that term. Let's hope this goes a bit Streisand and the scumbags lose a lot of business.","score":2},{"text":"how long until the genius users on voat claim Ellen Pao was behind this.","score":0},{"text":"Great Press Release from Voat.  Right out of Saul Goodman's handbook too.\n\nMaybe someone will dig the real reason up on why they were kicked off the hosting.","score":3},{"text":"I wonder who tipped them off to the \"political incorrectness\". Surely it wasn't Reddit /s","score":0},{"text":"Shady as fuck.\n\nWho knows what kind of dark dealings were going on behind the scenes...","score":2},{"text":"A couple of days ago I saw voat.co for the first time. It was linked in a Reddit thread. I commented on it being a Reddit ripoff, certainly in appearance and concept, and got down voted to oblivion.\n\nCan someone explain this Reddit ripoff to me?\n\n","score":0},{"text":"And nothing of value was lost.","score":-3},{"text":"Seems that SRS are celebrating and claiming responsibility for the takedown...\n\nBut shouldn't they have been happy that some of the uglier elements of Reddit were moving away?\n\nConflicted about this. FPH was disgusting, but stuff like that is probably  a reasonable price to pay for relatively free speech.","score":5}]},{"title":"Only 1 percent of “up to 76Mbps“ customers actually get 76Mbps from UK ISPs","url":"http://arstechnica.co.uk/information-technology/2015/06/only-1-percent-of-up-to-76mbps-customers-actually-get-76mbps-from-uk-isps/","permalink":"/r/technology/comments/3af1bv/only_1_percent_of_up_to_76mbps_customers_actually/","score":144,"numComments":16,"subreddit":"technology","comments":[{"text":"Good to know I am in the 1%.","score":3},{"text":"Blows my mind this shitty ISP industry, here in America anyway, can advertise, charge, and never supply speeds people purchase and have zero consequence.\n\nEdit: And in my case, then get hounded non-stop to sign up for 'auto-pay'  so you know, these thieves can get paid on time.","score":-3},{"text":"I am with PlusNet, and I get my max speed almost constantly. ","score":0},{"text":"I get about 64mb over LAN. I'm not complaining though I'm getting gigabit soon.","score":0},{"text":"I AM THE 1%!\n\nBut seriously, I was advertised 'up to 80Mbps' by BT and thought that I would at best get 60-70. And on a day to day basis, the speed will never drop below 70Mbps which I think is pretty good, especially considering I live in a little village.\n\n[This is the speedtest](http://www.speedtest.net/my-result/4445316693) I just ran (with lots of stuff open too!) and that was to London, which I live 60 miles away from. \n\nFor once, BT have been amazing considering I used to get about 1Mbps (down!) and now I get faster internet then some of my friends who live in built up areas.\n\nEDIT Added the link, oops","score":10},{"text":"Ahh epb fiber optics. Thank you for your wonderful service. If you pay for 100mb up/down you get anywhere between 95 - 105mbs up/down","score":5},{"text":"That's horrible. [My ISP in the US is 50 mbps off the \"up to\" speed so I know the feeling](http://www.speedtest.net/my-result/4419882176). Someday we'll get justice.","score":-1},{"text":"To be fair, they ALL get \"up to 76Mbps\".","score":2},{"text":"I only get 74. Every Sunday they seem to automatically speed check 76 and it goes unstable and drops out a few times then it drops back down. Getting the last two isn't as important to me as them getting it stable. ","score":2}]},{"title":"Dell is back in bed with Linux","url":"http://www.techrepublic.com/article/dell-is-back-in-bed-with-linux/","permalink":"/r/technology/comments/3adtiw/dell_is_back_in_bed_with_linux/","score":303,"numComments":46,"subreddit":"technology","comments":[{"text":"I remember Delbuntu on my Mini 9. They shut down their apt servers 12 months later. Stock Ubuntu worked much better apart from NDIS wireless drivers. ","score":2},{"text":"Speaking of dell..I called their customer service line the other day to get a replacement battery and charger for my alienware laptop and the guy talking to me sent me to ebay to find the parts...ebay...seriously?","score":0},{"text":"Technically, you could say they've been in bed with Linux since their first Chromebook release.","score":0},{"text":"https://www.youtube.com/watch?v=WRWrmT0ovPE","score":0},{"text":"Dell has been in bed with Linux for a while.  The problem is, Dell has always been fully dressed, including shoes, winter coat, and snow pants, and would only think about fooling around if you wanted a Linux server.","score":-2},{"text":"the security set on the features page makes me laugh\n\nNo Anti-virus Required\n\n","score":0},{"text":"If only Gnome 3 wasn't so horrible. Maybe newbies won't care.","score":-1},{"text":"Too bad the resolutions weren't better and too bad they don't have a RJ-45 port.  Anyone know how these do with FreeBSD?","score":-4},{"text":"Scumbag Dell:\n&gt;we are serious about your privacy... have this highly privacy-invasive DE pre-installed","score":-4},{"text":"What is Dell now?  Does Dell even know?  Are they a server company? A PC company?  A consulting company?  Dell confuses me with their inability to be something.  We know IBM is a consulting company and HP sells hardware but Dell is some cloud of stuff that seems to be looking for itself.  ","score":-2}]},{"title":"Military clearance OPM data breach ‘absolute calamity’","url":"http://www.navytimes.com/story/military/2015/06/17/sf-86-security-clearance-breach-troops-affected-opm/28866125/","permalink":"/r/technology/comments/3afepo/military_clearance_opm_data_breach_absolute/","score":50,"numComments":7,"subreddit":"technology","comments":[{"text":"I knew they'd find a way to fuck me over even after I got out of the military.","score":-4},{"text":"At least whenever the govt. tries to enforce Marshall Law, no one is gonna wanna do it.","score":-1}]},{"title":"Verizon ordered to finish fiber build that it promised but didn’t deliver | Ars Technica","url":"http://arstechnica.com/business/2015/06/verizon-ordered-to-finish-fiber-build-that-it-promised-but-didnt-deliver/","permalink":"/r/technology/comments/3abbds/verizon_ordered_to_finish_fiber_build_that_it/","score":3845,"numComments":197,"subreddit":"technology","comments":[{"text":"Glad to see this happening, it's a shame that this is just with regards to New York City, but it's a good start. The ISBs collectively received (and I believe this is the legal term) a fuck ton of money to build out the country's internet infrastructure and have fallen short from what they promised to do.\n\nIt's great to see that a city is willing to get tough with them, it's unfortunate Verizon's very obvious response was to drag its feet. Here are a few of they very terrible highlights...\n\n&gt; Verizon is disputing New York City's findings. ... blamed Hurricane Sandy, even though Verizon was still claiming to be \"ahead of schedule\" in April 2013 [a year later] ... Verizon last year blamed landlords for delays.  ... [However p]roperty managers interviewed by the city said Verizon has refused to extend service to buildings unless the company was granted exclusive agreements that would shut out other providers.\n\ntl;dr: Verizon is fucking terrible. ","score":-12},{"text":"Here's what Verizon got away with in PA, too:\n\n2.1 billion PA taxpayer dollars lost to Verizon: https://www.techdirt.com/articles/20131012/02124724852/decades-failed-promises-verizon-it-promises-fiber-to-get-tax-breaks-then-never-delivers.shtml\n\nAnd as of 2010 they stopped any further roll out and they are never going to finish: http://www.enterprisenetworkingplanet.com/netsp/article.php/3873221/Verizon-Halts-Further-FiOS-Expansion.htm","score":-4},{"text":"As a New Jersey resident, I'm pissed. Why the hell did we let them off the hook?  More than half the damn state still doesn't have fios. ","score":-12},{"text":"Good, it's about time somebody held Verizons feet to the fire for at least one of their broken agreements.","score":0},{"text":"&gt;Verizon further said that \"it is important to note that it’s not a mere coincidence that the report is made public today, and labor negotiations with our largest union begin on Monday. It’s well known the union has ties to the city administration, and things like this are a familiar union tactic we have seen before.\" The Communications Workers of America union has blamed Verizon's fiber shortcomings on job cuts.\n\nGo ahead and take a pot-shot at labor unions while you're at it. You're grown adults, you have the money, why not behave like children and play the \"nuh-uh\"/\"uh-uh\" game, disparaging your own employees in the process?\n\nCompanies who behave like this in public should have their business licenses revoked. ","score":4},{"text":"Last night I asked some utility guys what they were working on in Portland, OR. They said they were installing fiber optic for Verizon, but not for FIOS, but to the cell towers themselves.\n\nI just looked it up an it is called Fiber-to-the-Antenna, or FTTA, if you are interested.\n\nhttp://multimedia.3m.com/mws/media/802292O/ftta-best-practices-for-the-tower-hand-white-paper.pdf\n\nhttps://www.tessco.com/yts/knowledge_center/su/fiber_to_the_antenna_ftta_revolutionizes_cell_site_builds.html","score":0},{"text":"Fuck it.  Make them pay back anything they were given or subsidized with interest and give it to google to build the network.","score":-4},{"text":"My building has had the micro conduit and mdu boxes installed well over a year ago. No progress has been made. I call every 4 months and no ever has an answer for me. It is crazy our building did major hallway renovations to accommodate the conduits and yet the company line is \"unfortunately many landlords are blocking our access\". I'm like \"they let you guys tear our building apart there is no way this is the fault of my building\"","score":-2},{"text":"there's a \"dark fiber\" article out there detailing how the telcos got away with stealing billions of dollars from their subscribers by charging them for fiber op lines, but never delivering them.\n\nit was part of the de-regulation deals made back in the '80s &amp; '90s.\n\ncringely @ infoworld wrote them","score":0},{"text":"I literally live across the street from a giant Verizon building. 2 years ago they said we would have FIOS, now they have guards that don't let me in the building &gt;:|","score":0},{"text":"So take away their franchise license and be done with it.","score":0},{"text":"Looks like this will be in court for the next million years.","score":2},{"text":"I hope they nail verizon to the wall.","score":2},{"text":"They did the same thing in NJ but our corrupt as fuck politicians didn't do shit.","score":-8},{"text":"Fine them a million dollars for every day they are behind schedule.","score":2},{"text":"Is it sadistic that I get a little bit of glee, building on to previous glee, every time a telecom giant has to act like a company run by moral human beings who have to obey laws?","score":8},{"text":"Verizon is pretty much half of the old Ma Bell AT&amp;T from the 1980s, whom historically \"took the money and ran\" from the government regarding infrastructure.\n\nGovernments need to stop giving telecoms money. History keeps repeating.","score":0},{"text":"I think it's time that all the fiber in the ground is seized under eminent domain and setup as a utility. We already paid the telecoms to rollout fiber and they used the money to build wildly successful cell phone networks and said it would be too expensive to finish the fiber rollout.","score":3},{"text":"&gt; Property managers interviewed by the city said Verizon has refused to extend service to buildings unless the company was granted exclusive agreements that would shut out other providers.\n\nThere you have it. ","score":2},{"text":"Went to NJ and witnessed just how broken Verizon's new gateways for 100/100 and service are.... Can't hold a wireless signal at close distance for 3 minutes.","score":-1},{"text":"Here I am upstate with no fios due to them cutting expansion here to invest it in NYC. I hate TWC but it's my only option now. ","score":-5},{"text":"C'mon NJ what the fuck. Get on this","score":-4},{"text":"It's really shitty that they're doing this, however if you ever do have the opportunity to get FIOS it really is a great service. Over the years I've had Comcast, Cablevision, and DirecTV. Of those three DirecTV was the best for TV but couldn't compete with internet. Comcast and Cablevision are downright awful for service and reliability.\n\nI have had FIOS for 5 years and it's really been a pleasure, the internet speeds are great, the customer service (for me) has always been spot on. The pricing is a bit higher than I would want to pay but I don't mind paying a higher price if I'm getting what I expect.\n\nI know I sound like a FIOS shill but this has really been my experience.","score":10},{"text":"At least once a week junk mail from Verizon arrives telling me about Fios even though I don't have Fios on my street. Their reason is because my street has underground utilities and it costs more than aerial fiber. ","score":0},{"text":"And here I am in NJ with no Fios and we were just okay with them pocketing billions from us. What the fucking fuck. Sometimes I think I hate Verizon more than Comcast.","score":-12},{"text":"Does this mean the fiber lines they started in my neighborhood but never finished will be available? Will I finally be free from Comcast?!","score":1},{"text":"Could it be Tom Wheeler is truly ready for a redemption?","score":0},{"text":"Where I live the choice is Antietam Cable (who's that? I know I know). Comcast has better pricing and is available to businesses only in my area. Consumers 9 miles away have Comcast and a small portion have access to Fios. 14 miles away the major city of Frederick has only Comcast as an option. I get to watch FIOS commercials knowing full well I'll never see them here. This industry is a mess. I'd kill for Comcast here. This small cable company charges more for less because they can. My only option is satellite, so I have to pay whatever they charge. I hate it.","score":-11},{"text":"Watching these giant telcos step on their own genitalia is fun to watch.","score":4},{"text":"Fuck yeah, *punish them hard!*","score":-6},{"text":"I love my Fios","score":3},{"text":"I can't stand the white text on black background of Ars. Hurts mah eyeballs.","score":-2},{"text":"I envy the way your government shits on these telecomm companies.   Living in Canada and getting gouged for shit service. Always.  $100/month cell phone plans,  $100 tv package, shitty 100 Meg Internet that I can hardly pull 30-40 out of.   ","score":-8},{"text":"[deleted]","score":0},{"text":"Problem accessing households because of landlords? What about my parents' single-family home that still isn't wired? They've been waiting for fiber for years.","score":-2},{"text":"meanwhile i just ordered 1000/1000 internet for € 40,= a month....","score":0},{"text":"Pretty funny.  Verizon is trying to claim that they only need to have fiber in each of the 5 boroughs, while the city is under the impression that it needs to be available to every household, which verizon has said is not the case.  Will be down to whatever is actually in the contract, but from all i've heard over the years regarding this deal, verizon is pretty screwed legally.","score":5},{"text":"fuck verizon","score":-4},{"text":"How does Verizon define household? No one I know has fios available.  I don't understand how they can say they fulfilled their promise.","score":2},{"text":"What's sad and funny is the city is doing them a huge favor with these penalizations .They are forcing VZ to build their infrastructure to a larger customer base. Poor VZ.... The reason why VZ hasn't built it out is because the executives need to show growth year after year to their stock holders. The expense will be noted as a dip in year after year profit growth, which affects share holder good will and the executive's year end bonus. Verizon will be much stronger after this - being able to service most house holds in NYC and their customer service policy will be exactly the same or worse. Not good.","score":13},{"text":"Honestly i hate the shadyness of verizon, but i believe what they say about unions. Modern day unions have seemingly evolved into extortion rackets.","score":-3},{"text":"[As a resident of NYC...](http://i.giphy.com/77a70scuBl2p2.gif)","score":0}]},{"title":"Jetpacks Are Going Mainstream Faster Than You Think, But They Won’t Come Cheap","url":"http://bgr.com/2015/06/18/jetpacks-commercial-use/","permalink":"/r/technology/comments/3ae9if/jetpacks_are_going_mainstream_faster_than_you/","score":132,"numComments":31,"subreddit":"technology","comments":[{"text":"&gt;Pricing for an individual unit is believed to be in the $200,000 range.\n\nThat's not mainstream in the slightest. Stuff has to be affordable to call it mainstream. ","score":0},{"text":"Banner image shows some sleek Look-Ma-I'm-a-Jet winged gadget.\n\nVideo shows bulkiest awkward one-person Wonkavator prototype.","score":-2},{"text":"22.5 miles in 30 minutes and you better land at a gas station.  I do not think that is main stream.","score":2},{"text":"That's not a \"jetpack\"; it's not a pack you strap onto your back. It's simply a freestanding flying machine that you can strap yourself into, not much different than a helicopter. Just because you're standing up when strapped into it doesn't make it a \"jetpack\". ","score":0},{"text":"I watched the video of the Jetpacks over Dubai, and it shows they still need a helicopter to get in the air initially. Additionally, it doesn't show how they land, which is something I'm most curious about. I mean, they seem to be going pretty fast, how do they prevent just slamming into the ground on landing?","score":1},{"text":"People can't drive, what makes you think I want them flying?","score":1},{"text":"When has new technology ever been cheap?","score":0},{"text":"Jetpacks? Check. \n\nRealistic robot fuck dolls? Get your shit together scientists!","score":-8},{"text":"Needs to be smaller and lightweight. Something that doesn't require a parking spot if you're going to call it a jetpack. I should be able to take it off when I get to my desk.","score":0},{"text":"They won't be cheap *at first*. If that big order goes to China as the article states, soon China will start cranking out clones. Martin Aircraft will soon have to compete against their biggest customer.","score":1},{"text":"Did anybody look at the video. This is not a \"Jet\" and it is not a \"pack\".  \n\nThis is like rigging a Mini Cooper to run some fans and strapping yourself to the roof.  ","score":2},{"text":"sorry but I don't think so. They will never be mainstream and this is a relief. The world thanks. Imagine stoned, drunk, irresponsible people flying those things. Imagine losing your privacy because some asshole is flying over your property. No, thanks.","score":-5},{"text":"Seems more like a jet without a cockpit than a \"jetpack\"","score":2},{"text":"This thing will be available to the public in less than *two* years. It can travel for 30 minutes at 45 mph and will cost $200,000. Within 3 years I predict it will drop to $100,000 and fly for 60 minutes, 2 years later $50,000 with 90 minutes of flight.\n\nI think it entirely possible within 10 years of going public, this technology combined with the machine learning being developed for self driving cars and the rapid development of battery and solar technology may see us finally getting the promise of a flying 'Johnny Cab'\n\nFantastical as it may seem, we are facing a very steep curve of accelerating returns. The ramifications to city infrastructure projects like public transit programs scheduled to be completed in 2030 are likely to require reworking or face obsolescence.","score":2}]},{"title":"FCC grants telecoms the ability to block robocalls and spam texts","url":"http://www.techspot.com/news/61048-fcc-grants-telecoms-ability-block-robocalls-spam-texts.html","permalink":"/r/technology/comments/3afptm/fcc_grants_telecoms_the_ability_to_block/","score":37,"numComments":4,"subreddit":"technology","comments":[{"text":"The FCC is on a roll!","score":0},{"text":"See, government *can* do good things that benefit We the People!\n","score":5}]},{"title":"Heinz forced to apologise after QR code on ketchup bottle linked to hardcore porn site","url":"http://www.independent.co.uk/life-style/food-and-drink/news/heinz-forced-to-apologise-after-qr-code-on-ketchup-bottle-linked-to-hardcore-porn-site-10327313.html","permalink":"/r/technology/comments/3aariq/heinz_forced_to_apologise_after_qr_code_on/","score":5237,"numComments":1113,"subreddit":"technology","comments":[{"text":"TLDR: The mix-up was down to the fact that Heinz ran the contest between 2012 and 2014, and the link expired this year, TheLocal.De reported.","score":0},{"text":"How did anyone notice this?\n\nThe only moment where I'd feel bored enough to scan a QR code is on the toilet, in which case I don't have ketchup nearby.","score":-2},{"text":"And the best part: \"Taking advantage of the free advertising, Fundorado also commented on the photo, and offered Korell a free year's subscription.\"","score":7},{"text":"Sauce?","score":0},{"text":"That's amazing, somebody scanned a QR code on a consumer product...?","score":4},{"text":"Nowhere in that article did I see anything about Heinz being *forced* to apologize. That title is so misleading. It leads you to believe Heinz initially refused an apology, then some other court or *FORCE* made them apologize, Which is far different from what happened, which was just a simple mixup, and a polite apology. ","score":-10},{"text":"[If you came here to see the site it linked to.](http://www.fundorado.de/free/) [NSFW]","score":0},{"text":"Which hardcore porn site? There are so many of those disgusting hard core porn sites, but which one?  ","score":-4},{"text":"&gt;forced to apologize\n\nWere they staunchly unrepentant at first?","score":0},{"text":"Found the one person who bothers to go online for those lame promotions and code websites on products.","score":-4},{"text":"&gt;__Read more:__ Heinz swallows rival Kraft\n\nFucking gold right there :D","score":0},{"text":"[Here's a video I found on their site](http://stream1.gifsoup.com/view6/3583215/heinz-automato-o.gif)","score":0},{"text":"I think I just squirted.","score":0},{"text":"**Warning**: very loud autoplay video advertisement on this website.","score":-3},{"text":"You know what they say.... Heinz-sight is 20/20...","score":0},{"text":"/r/nottheonion","score":0},{"text":"that code was supposed to be on the mayonnaise ","score":0},{"text":"I call BS no one has ever used a QR code\n\nSource\n\nhttp://picturesofpeoplescanningqrcodes.tumblr.com","score":-1},{"text":"I am more shocked someone actually uses those QR codes.","score":-2},{"text":"Maybe this is all just a ploy to get people to scan their bottles...","score":0},{"text":"The real issue at hand here is: How the fuck do you still have to specify hardcore with porn site in 2015? I dont remember the last time I saw a porn site that didnt have any hardcore.","score":-4},{"text":"Who the fuck was scanning QR codes on a ketchup bottle?","score":-4},{"text":"Rule 57?","score":0},{"text":"Just keep squeezing it and tapping the bottom until it comes out","score":0},{"text":"Ketchup Porn is pretty Hardcore","score":1},{"text":"The trampling sound you hear is a rush to kitchens everywhere, phones in hand.","score":0},{"text":"To be fair its not as if anyone uses qr codes. ","score":2},{"text":"He should have designed the logo to have two silhouettes getting it on behind the Heinz logo and then the slogan say \"I don't mind ketchup on my hotdog as long as the buns are tight.\"","score":0},{"text":"\"forced\" to apologize...","score":-2},{"score":0}]},{"title":"Sprint stops throttling heavy users to avoid net neutrality complaints","url":"http://arstechnica.com/business/2015/06/sprint-stops-throttling-heavy-users-to-avoid-net-neutrality-complaints/","permalink":"/r/technology/comments/3aan0f/sprint_stops_throttling_heavy_users_to_avoid_net/","score":4214,"numComments":337,"subreddit":"technology","comments":[{"text":"I'm at 50gb so far this month with 4 days left on my billing cycle. I've seen my speed drop down to 3g many times, when downloading things. It doesn't matter if it's in the afternoon or middle of the night. Why do I use so much mobile data? My dsl connection at home is flaky and slow and times out downloads often. I'm getting tired of unplugging the router and resetting it. My most recent good speed test run. http://i.imgur.com/wytZz24.jpg","score":1},{"text":"I never had good enough service to hit 5gb on Sprint anyways.","score":3},{"text":"\"Sprint said it believes its policy would have been allowed under the rules, but dropped it just in case,\" The Wall Street Journal reported.\"\n\nSo why not call/ask the FCC for a clarification? And WTF are they paying their salaried lawyers for.","score":-4},{"text":"Yeah after AT&amp;T gets hit with a $100M fine... good move Sprint.","score":6},{"text":"I've been using sprint unlimited data quite a lot and never experienced any throttling. ","score":0},{"text":"Virgin Moblie is still doing it though. Sucks.","score":-3},{"text":"Competition, uh, finds a way","score":0},{"text":"Sprint doesn't  have to throttle you, the poor signal keeps you from downloading a significant amount of data.","score":-1},{"text":"Sprint data might not be the best but it's pretty decent in North Dallas. It's super cheap compared to other carries too. I use my wifi way more than LTE so I'm good where I'm at","score":10},{"text":"Does anyone know if this applies to virgin mobile as well since they run on Sprints network? Im tired of getting throttled after 2.5gb of 4g.","score":-2},{"text":"Stupid question, but wasn't net neutrality about treating all traffic equally, thus throttling all traffic equally would be fair right?\n\nI mean, i like that they stop it, but i don't get the reasoning","score":1},{"text":"I love my Sprint unlimited plan.  Tether and beat the hell out of it streaming sports over slingbox at work.  Sometimes I felt like I was being throttled down to like 1.5mbps but nothing too bad.  It always worked good.  This is welcome news however.  I'm never letting my old sprint plan go.  I suffered for many years and now it's finally paying off.","score":5},{"text":"I've had Sprint for quite awhile. I've never been throttled. I do get good coverage where I'm at. Using the FCC Speed Test App on Android I currently got 8.71Mbps down, 848.64Kbps up, latency of 63ms, 0% Packet loss pinging L.A. from WA. Not the most amazing speeds, but i've hit over 90GBs in a month and never heard from Sprint.","score":4},{"text":"Since the article doesn't clarify, I figure I'll mention the difference between throttling and deprioritization, as per T-Mobile. Throttling means a limit is set. In other words, if you fall in that top 3%, during times of high congestion, you would simply be limited to a certain speed regardless of whether or not the network has a moment during which it can deliver higher speed to you. Deprioritization simply means that the network will still try to get you your data as fast as possible, but if you are in the top 3%, if the entire bandwidth of the network is full, you'll be the last to receive data above the throttled speed.","score":2},{"text":"I've been on Sprint for over 2 years now. I love them compared to the others.\nNote: I've tried Verizon, ATT, and T-Mobile as well","score":3},{"text":"NO FAT SHAMING!","score":-1},{"text":"I use 100GB per month on Sprint so maybe you all should stop beating a dead horse. I get 65mbps in my house, 45 at work. There are dead spots on my commute but for $50 I'll live with it.","score":-10},{"text":"It's such a rare thing to see a corporation actually tremble to government.","score":0},{"text":"I hit 19 gb last month is that considered heavy?  And my wife almost got 10","score":0},{"text":"Uhhh, I signed up for sprint 4 years ago and managed to get unlimited data while that was still a thing. I've since traveled the country (38 states) and rellied heavily on my phone and I can't say that I've ever been unhappy with sprint. The few times I lost connection where out in remote (usually mountainous) areas where my buddy/ co-pilot who uses AT&amp;T also had no service. There was actually occasions where I had data and he didn't, as well as vice versa but it was always in areas with super dodgy connections.\n\n\n\n\n\nI honestly love sprint and I have no idea what people are talking about or why they bitch. I have unlimited data, my bills haven't changed in 4 years and my phone has never let me down short of being out in the middle of fucking no where, where I expected to have no signal. Worth noting tho that I've rarely put my unlimited data to use as I don't stare at my phone all day, especially when I'm traveling. ","score":-12},{"text":"I've had sprint for about 4 years, starting with a 4s and now onto a 6+. For years I complained about slow speeds, with my 5 struggling to even beat my crappy DSL line. HOWEVER, last year things really changed. I just ran a test and I had 32.45 mb/s down and 8.16 mb/s down, with a 54ms ping. For comparison, my crappy DSL service gets 3.75 down and .44 up, 35ms ping. Now, I'm paying for 3 down, so I guess that's better than what I'm paying for. \n\nI travelled to Florida earlier this month and was off wifi for the better part of a week. I'm a heavy data user; I just check my usage for this billing cycle, and my usage is 4.9 GB with 15 days left in the cycle. \n\nSure Sprint's coverage in rural areas is really crappy, to the point that I occasionally whine to my wife when we visit her relatives who live in the middle of nowhere, but I get over it and visit family. \n\nWe are moving overseas in a few months and I'm actually a little sad to give up my unlimited plan for when we come back in two years. ","score":-2},{"text":"I didn't know Sprint was fast enough to get to a throttling limit.  I'm on it and until last year, could barely stream pandora\n ","score":0},{"text":"Now maybe they can focus on not having such shitty coverage. I shouldn't know which parts of my counter to place my phone on to get better reception.","score":-1},{"text":"[peasants!!](http://i.imgur.com/P3ucE88.jpg) ","score":0},{"text":"I had Sprint for all of 6 months, broke my contract to get out. They kept charging random things to my account and service was barely usable. That was years ago (when Wimax was brand new) Been on T-mobile since then and what a HUGE difference in coverage and speed. If the coverage is good enough in the area, I'd say switch as soon as possible. No more nightmares with terrible phone service","score":-1},{"text":"That explains why I can watch YouTube videos without them stopping every three seconds, now.","score":-1},{"text":"They'll just raise prices someplace else.","score":0},{"text":"This kind of stuff is working.  I filed an FCC complaint against comcast throttling my internet on friday the 12th.  By monday the throttling was gone and I got a call from comcast on tuesday asking if there was still a problem.  The FCC really does take those complaints seriously.","score":0},{"text":"Anyone know if that affects all providers that use the Sprint network?","score":0},{"text":"I use a Hotspot Mod on my rooted S5, guess I know why my ping was rising in games. For reference: I use about 75 GB of data per month of this thing. This. Is. Huge.","score":1},{"text":"This is why net neutrality is so important. Big pocketed ISPs should be afraid of ripping off customers. The issue pre-net neutrality was the lack of authority to really keep ISPs responsible. I hope to see this change going into the next couple of years. I believe Sprint did this in response to the legal issues AT&amp;T is now facing.","score":5},{"text":"It's already working.","score":0},{"text":"This article is under the assumption you can get a signal.","score":0},{"score":0}]},{"title":"In Beats headphones, 30% of the weight comes from four tiny metal parts that are there for the sole purpose of adding weight.","url":"https://medium.com/@BoltVC/how-it-s-made-series-beats-by-dre-154aae384b36","permalink":"/r/technology/comments/3abisj/in_beats_headphones_30_of_the_weight_comes_from/","score":2066,"numComments":321,"subreddit":"technology","comments":[{"text":"Heavier speakers were better at one time.  Bigger, stronger magnets and larger coils all add weight.  Over time companies started faking it so weight is no longer an indication of internal construction.","score":0},{"text":"Your life is a lie! \n\nSennheiser forever!","score":0},{"text":"[For the lazy, this is a picture of those weights] (https://d262ilb51hltx0.cloudfront.net/max/1200/0*JZQYWffXIR4Z_CXA.) ","score":-1},{"text":"It should be pointed out that the product in the article are the discontinued first generation Monster Beats by Dre Solo's. \n\nThe second generation Beats Solo2 are designed, engineered and manufactured by a different company. The only relation between the two products is the \"Beats\" branding. ","score":0},{"text":"[Jurassic Park wisdom](https://www.youtube.com/watch?v=OA1vmN-skXo) 20 years later","score":0},{"text":"While this isn't an uncommon thing, especially in small electronics, beats headphones are still priced more for the label than the quality.  You could buy something like Beyer Dynamic or another studio/reference headphone set for the same money.  Brand name and asthetics sell better than capability and quality.  It's perception over performance almost every time.  Marketing rules the consumer world.","score":4},{"text":"I can vouch for this manufacturing process. . . I used to work for a electronics manufacture. .  We made essentially two items,  both used the same hardware but different cases and thus suited separate demographics. . . For one group we determined that guys were more likely to buy the item that weighed more because they felt they were getting more for their money. . . All we did was attach some steel weights inside the case. ","score":2},{"text":"All one needs to know about Beats headphones is that they started out being manufactured by Monster Cable. Monster has to have the **worst** cost-to-value index for their products of all manufacturers. It doesn't sound like Dre improved the products when they stopped licensing the Beats name and began making the headphones themselves.","score":0},{"text":"So Dr Dre is like [Boris the Blade?]( https://youtu.be/lX0MB7pJtKs) ","score":2},{"text":"Why care? They're incredibly crappy either way.","score":2},{"text":"Okay. I listen to people telling me a controller (Dual Shock) isn't any good because it's too light. You can throw it against a wall and it won't break but apparently it's no good because it's too light.\n\nSo I'm not at all surprised someone would add weight to headphones to convince this kind of person it's of better quality.","score":8},{"text":"Well good news is that there are literally tons of other headphone manufacturers that make better headphones for their price given. As for me, so far the best brands I've used are Sony, Audio Technica and Sennheiser. ","score":8},{"text":"why are heavier headphones better?","score":2},{"text":"So it is like a washing machine?","score":2},{"text":"Does anyone have that graph that compares Beats' shit quality to other brands? \n","score":-4},{"text":"In Beats wearers, 70% of their cool factor exists only in their head.","score":1},{"text":"Dr. Dre thinks we're all idiots and when you're wearing those $299 POS headphones around your neck, he and the rest of us know you're an idiot.  ","score":-3},{"text":"Beats are GREAT headphones..... if your goal is to impress the other people on the bus that you are willing to spend $200 on a pair of headphones. ","score":6},{"text":"Okay. I have no problem with this. Heft is part of the overall feel - the design.","score":-3},{"text":"I realize that Beats aren't audiophile grade headphones, but it disappoints me to see this. I would much rather Beats use a more resilient, therefore heavier, material for the device rather than adding vestigial pieces of metal. I hope that Apple changes Beat's product design while keeping them in their niche part of the market.","score":0},{"text":"The article mentions the estimated cost to manufacture these to be $16.89 yet they cost $199. In the cost breakdown the most expensive components were the packaging. ","score":0},{"text":"Reminds me of the lawyer from the first Jurassic Park movie who said to the kids after they picked up a pair of binoculars \"are those heavy\" they said yes to which he said \"then they're probably expensive\". ","score":1},{"text":"This is actually not that uncommon.\n\nA colleague doing VoIP installation once showed me the difference between and American and the Europen version of a telephone. The most remarkable was that the handset was heavier in one version was much heavier. Apparently tests had shown that customer associated light handsets with low quality so they added some small metal weights to give the illusion of quality.\n\nOr as one dinosaur food in the original Jurassic Park put it when encountering some unknown piece of equipment:\n *\"Are they heavy? Then they're expensive, put 'em back.\"*","score":2},{"text":"In related news, Beats headphones 100% off the color comes from paint added with the sole purpose of covering the product. /s\n\nSeriously, this is a design decision. Not every part of every device needs to be functional. Some of it is just to make it feel/look different. How is anyone shocked at that?","score":-2},{"text":"Just another reason to buy AKG, Grado, or HiFiman. ","score":0},{"text":"My son recently turned 13 and asked for the current Beats Studio noise cancelling headphones.  I tried every trick I could think of to get him to pick another brand.  I suggested Audio Technica, Beyerdynamic, etc.  We demoed lots of alternatives.\n\nThe problem with kids these days, besides always being on my lawn, is that they want something trendy first, and as long as it sounds *good enough* to them, then that is the perfect choice, so he chose the Beats headphones.\n\nOnce he got them, out of curiosity I tried them out in a comparison with my [Sony MDR-7509HD](http://www.head-fi.org/products/sony-mdr7509hd-professional-headphone) headphones using my external USB processor/amp with dual jacks.  My cans are certainly not the best ever, but my god did they ever shit down the throat of the Beats.  Going from the Beats to the Sonys was like hearing music for the first time.  No muddied mids, crackling highs, over exaggerated bass, or annoying hiss from the shitty noise cancelling.\n\nI didn't go into the gory details of my test with my son, because it is still his birthday present and he seems to like it, so I casually mentioned to him that he has 30 days to return them if he's not satisfied, hoping that would plant something in his subconscious.  So far, nothing...","score":4},{"text":"And at least 30% of the price come from the name...","score":0},{"text":"There is more to selling a product than the sum of its parts.","score":0},{"text":"holy fuck the head phone snobbery of reddit drives me crazy.  It's worse than the craft beer snobbery.","score":-9},{"text":"Sounds like a B&amp;O remote control to me.","score":2},{"text":"&gt;I estimate that the COGS without labor or shipping is $16.89 - yet Beats is able to successfully retail these headphones for $199+  \n\ncheap bastards","score":-5},{"text":"Years ago I worked at Radio Shack. One day we opened up a phone handset for some reason.  It had a big chunk of metal glued in there, for that feeling of \"quality\".","score":2},{"text":"Beats are complete shit headphones.  They are low end junk sold for a high price to people who buy labels not specifications and quality.  Apple bought beats because they knew they could rope in a mess of know nothing brand loyalists who would buy any shit they cranked out as long as it had an Apple or \"B\" on the ear-cup.","score":-10},{"text":"always new they were overpriced weights","score":0},{"text":"The more interesting of this post in not mentioned. Anybody who buys these headphones is a sucker. They cost $17 to make. ","score":2},{"text":"Great article. As both an audiophile and someone who hates junk ripping people off on the market I'm really glad to see this. It's too bad there wasn't more articles like this when they first came out.  \n  \nTwo things I've always thought to myself:  \n1. Musicians often have poor hearing after years of abusing them to loud music on stage / parties/ etc.  Kinda like Beethoven, would you want a def man recommend headphones to you?   \n2. I can't really recall a single product in history sponsored by a celebrity that wasn't just some hyped up crap.","score":2},{"text":"hahahahhahaha more to this fucking scam ","score":-6},{"score":0}]},{"title":"Comcast ordered to unmask anonymous online newspaper commenter","url":"http://arstechnica.com/tech-policy/2015/06/comcast-ordered-to-unmask-anonymous-online-newspaper-commenter/","permalink":"/r/technology/comments/3aferl/comcast_ordered_to_unmask_anonymous_online/","score":26,"numComments":5,"subreddit":"technology","comments":[{"text":"It sounds like all they will get is an ip address.  ","score":2},{"text":"is an IP a person?\n\nAlso it'd be nice if politicians was scrutinized as much as this guy is going to be.","score":3},{"text":"Says \"it almost broke me, financially...\"\n\nWhy try so hard? Something to hide?","score":-3}]},{"title":"Pirate Bay's Peter Sunde says Australia's proposed website blocking scheme won't deter downloaders","url":"http://www.abc.net.au/news/2015-06-19/pirate-bay-cofounder-mocks-proposed-website-blocking-legislation/6559288","permalink":"/r/technology/comments/3adoor/pirate_bays_peter_sunde_says_australias_proposed/","score":184,"numComments":19,"subreddit":"technology","comments":[{"text":"Well, he's not wrong. \n\nAny nation that wants to deter illegal downloading needs to adhere to a fairly simple thought process; make the legal way the easier way. If the legal way locks users to playing a movie only on a specific device, its not easier. If the legal way costs more than buying a blu ray, its not easier. If the legal way has lower quality, its not easier. If the legal way requires specific hardware, its not easier. ","score":0},{"text":"VPN. Super cheap, easy, everything encrypted.","score":4},{"text":"No shit. The only people deterred by this sort of laughably ineffective barrier are people who aren't very confident with computers in the first place and certainly not part of the \"hardcore piracy\" crowd allegedly being targeted, exactly the same way invasive DRM only hurts legitimate consumers because pirates can just download a version with all that crap removed.","score":-12},{"text":"I used to download a lot but now I'm not concerned because Netflix. Also Presto &amp; Stan. Mainly Netflix. ","score":0},{"text":"I was surprised to see the author of \"Wyrmwood: Road of the Dead\" protesting piracy. I never saw that anywhere.","score":-5},{"text":"I wish they would just make it harder to connect. Keep out the casual leeches. don't forget to seed yall. Idc of its 10% of what you downloaded or 1000%; just chip in! ","score":0}]},{"title":"Utah Internet company files $60 million lawsuit over email spam","url":"http://fox13now.com/2015/06/18/utah-internet-company-files-60-million-lawsuit-over-email-spam/","permalink":"/r/technology/comments/3afwtn/utah_internet_company_files_60_million_lawsuit/","score":16,"numComments":1,"subreddit":"technology","comments":[{"text":"Meanwhile, Russian-owned bot nets make 100,000 spammed email addresses seem like a drop in the ocean...","score":1}]},{"title":"The employment issue with Uber is the same one companies like FedEx and Starbucks have faced in the past","url":"https://medium.com/ondemand/what-strippers-can-teach-uber-1f5b15e5b427","permalink":"/r/technology/comments/3aewqb/the_employment_issue_with_uber_is_the_same_one/","score":35,"numComments":0,"subreddit":"technology","comments":[]},{"title":"A New Form of ID Allows You to Be a Citizen of the World","url":"https://www.vice.com/en_uk/read/blockhains-first-citizen-328","permalink":"/r/technology/comments/3afj20/a_new_form_of_id_allows_you_to_be_a_citizen_of/","score":18,"numComments":5,"subreddit":"technology","comments":[{"text":"I already am a citizen of the world.","score":0},{"text":"If there are no nation states then why would you need a passport or ID to say who you are?","score":-1},{"text":"That seems like an overly large passport/ID.  Can't I just get that UID/Barcode tattooed on my neck or something?","score":2}]},{"title":"New Zealand's nationwide fibre to the home project hits halfway mark","url":"http://beehive.govt.nz/release/ufb-rollout-hits-halfway-mark","permalink":"/r/technology/comments/3ae64n/new_zealands_nationwide_fibre_to_the_home_project/","score":60,"numComments":5,"subreddit":"technology","comments":[{"text":"* [Video](https://www.youtube.com/watch?v=Du8a2re2Dxw) of the UFB project\n* UFB plans start at [NZ$79](http://billbennett.co.nz/2015/02/04/unlimited-fibre-broadband-plans/) (US$55) /month for unlimited 100/20. \n* Plans go up to 200/200 in most areas and gigabit in a few areas\n* You can choose from over 80 retailers.\n* A side benefit of the project is that the incumbent telco was split into two unrelated companies, a retail company and a network company, giving a fair playing field.","score":4}]},{"title":"Microsoft: Hololens field-of-view won't get noticeably different.","url":"http://www.theverge.com/2015/6/18/8809323/microsoft-hololens-field-of-view-kudo-tsunoda","permalink":"/r/technology/comments/3ae5zl/microsoft_hololens_fieldofview_wont_get/","score":55,"numComments":19,"subreddit":"technology","comments":[{"text":"If all that is true it seems like a huge misstep to demo it with such a large Field of view. \n\nI was at 10 for interest level and now I am at a 3. I feel like if they had come out with a more accurate demo I would have leveled off at 5-7.","score":8},{"text":"Not surprising. It probably adds a lot to power and processing requirements. Maybe in a second edition of the device.\n\nAnyway, I'd still be interested if everything does as good as a job as it appears to, it just doesn't look real. I mean it sounds like its true from reviewers, it's just crazy. Even with the smaller FOV than people were expecting. If the smaller FOV is the only problem they have with the first marketed version of the device, I'd consider that great if I was Microsoft.","score":8},{"text":"Jeff Gerstmann mentioned the small FOV to Phil Spencer on the Giant Bomb E3 Day 1 show. Jeff assumed the FOV would improve before launch, but Phil Spencer said it probably wouldn't change much.\n\nI'll give Spencer credit, he was pretty straightforward with his answers there. He also explicitly said without being prodded that Kinect 360 games won't work on Xbox One.\n\nHere's a link [http://www.giantbomb.com/videos/giant-bomb-live-at-e3-2015-day-01/2300-10378/](http://www.giantbomb.com/videos/giant-bomb-live-at-e3-2015-day-01/2300-10378/). Spencer is on about the 2 hours and 2 minutes mark.\n\nEDIT: The part about the small FOV is at about 2:09:00.\n\nEDIT 2: While Phil Spencer was talking too, it was actually Kudo Tsunoda who made the comment about FOV.","score":2},{"text":"But then again... this is the verge. Have they ever said anything good about MS?","score":3},{"text":"Nonsense. Unless keeping the FOV limited is a design decisions rather than a factor of processing power then the FOV will absolutely increase eventually. Maybe not during the lifetime of this particular iteration, but unless there is some physical reality preventing a wider field of view, it will increase.","score":-2},{"text":"Classic Microsoft.\n\nRelease a video/demo showing amazing things they (and potentially you) can do with some amazing new technology they've created, only to have the final product be a mere shadow of its promise.\n\nI rightly held my hype in check when it was first announced for this reason.","score":8},{"text":"Honestly, I don't think a smaller field of view will be as big of a deal as it sounds once you get used to it. It obviously won't give you a full immersive effect, but it will still be really cool.","score":2},{"text":"that's disappointing...","score":-2},{"text":"Kind of funny when the original Xbox and stuff like Halo caused FOV in games to get notched way down for the first time ever.","score":8}]},{"title":"IMAX apologizes to Ars for its trademark retraction demand","url":"http://arstechnica.com/tech-policy/2015/06/imax-apologizes-to-ars-for-its-trademark-retraction-demand/","permalink":"/r/technology/comments/3afycv/imax_apologizes_to_ars_for_its_trademark/","score":10,"numComments":0,"subreddit":"technology","comments":[]},{"title":"Huge fine for AT&amp;T over speed brakes - BBC News","url":"http://www.bbc.co.uk/news/technology-33183368","permalink":"/r/technology/comments/3ae4g4/huge_fine_for_att_over_speed_brakes_bbc_news/","score":56,"numComments":2,"subreddit":"technology","comments":[{"text":"really, speed brakes?","score":0},{"text":"False.  That's not a *huge fine* by any stretch of the imagination.","score":3}]},{"title":"Reddit Is Switching to Total HTTPS Encryption","url":"http://blog.lifars.com/2015/06/19/reddit-is-switching-to-total-https-encryption/","permalink":"/r/technology/comments/3aefs1/reddit_is_switching_to_total_https_encryption/","score":35,"numComments":9,"subreddit":"technology","comments":[{"text":"is there a reason for http anymore? everything should be encrypted.","score":0},{"text":"I've been using the \"HttpEverywhere\" plugin for a long time now, so I didn't even realize there was a non-secure version.","score":0},{"text":"welcome to the 21st century.","score":2}]},{"title":"Secret Service agent who stole $820K from Silk Road pleads guilty","url":"http://arstechnica.com/tech-policy/2015/06/secret-service-agent-who-stole-820k-from-silk-road-pleads-guilty/","permalink":"/r/technology/comments/3abtte/secret_service_agent_who_stole_820k_from_silk/","score":665,"numComments":39,"subreddit":"technology","comments":[{"text":"If you haven't read this two-part long-form article on the investigation into Silk Road, this is a must-read:\n\nhttp://www.wired.com/2015/04/silk-road-1/\n\nhttp://www.wired.com/2015/05/silk-road-2/\n\nI read them in the print edition. Force is a major character, but I don't remember anything about Bridges.\n","score":0},{"text":"&gt;It was Bridges' massive theft that led Silk Road boss Ross Ulbricht, who operated online as Dread Pirate Roberts, to contract a murder-for-hire against Green, who he believed had perpetrated the theft. That resulted in a murder-for-hire charge against Ulbricht, which is still pending.\n\nWhy would the outcome of this matter? He already has life in prison.","score":-3},{"text":"Thank god for the hero cops keeping us all safe!","score":6},{"text":"This whole thing smells rotten","score":0},{"text":"Check out [Dark Web](http://www.epixhd.com/movie/deep-web/) on Epix.","score":0},{"text":"Why is the secret service investigating a drug site?","score":0},{"text":"Can we start executing civil servants who steal cash through abuse of their position. I'm starting to feel like this is the only way to get the government to stop.","score":-4},{"text":"Well I guess those two are not going to make the Detail.","score":0},{"text":"I thought it was closer to $3 Million, or is that just the BTC price in flux?","score":0},{"text":"How did he get caught?","score":0},{"text":"good. i cant wait for the abuse of power charge gets tried. They forced several businesses (including mtgox) to cooperate via frozen US assets and and gag order.","score":-1},{"text":"So this article and the other link both say he took a plea, but neither seem to mention what it was?  Probs some weak ass probation while the guy they stole from will be there Foreeeeevvvvveeeerrrrruuuuuuuhhhhh","score":-6},{"text":"He a bad cop. Give him the max move on. ","score":-3},{"text":"There was a two part series on this whole story in Wired in the past couple of issues, and it's really a very interesting story.  There's a book coming out by the same writer.  This is definitely one of those stories that you just can't make up.  Crazy stuff!","score":0},{"text":"We pay for these people out of our paycheck....not by choice. Would you expect anything less from the highway robber that demands your money in return for false promises? ","score":-3}]},{"title":"Here’s how to get Windows 10 for free even if you don’t have Windows 7 or 8","url":"http://arstechnica.com/information-technology/2015/06/heres-how-to-get-windows-10-for-free-even-if-you-dont-have-windows-7-or-8/","permalink":"/r/technology/comments/3ag0ct/heres_how_to_get_windows_10_for_free_even_if_you/","score":8,"numComments":0,"subreddit":"technology","comments":[]},{"title":"This Chrome App Is Trying to Save Indie Bookstores From Amazon","url":"http://www.theepochtimes.com/n3/1396949-this-chrome-app-is-trying-to-save-indie-bookstores-from-amazon/","permalink":"/r/technology/comments/3aecsq/this_chrome_app_is_trying_to_save_indie/","score":27,"numComments":0,"subreddit":"technology","comments":[]}]}]
